{"pages":[{"title":"关于本站","text":"缘起自己什么时候有了「开博客」的念头，具体已经搞不清了。只记得 16 年的时候，看着周围的同学有了自己的公众号，加上那个时候开始在 少数派 「高强度」输出，就迷迷糊糊开了个公众号，结果一直没动过，直接被收回了。后来了解了公众号的种种弊端，就决定搞个博客，奈何当时对计算机相关的知识几乎是零（现在也没到一），成功用 Hexo 运行了默认的 Hello World 页面后，就搁置了。 前世 &amp; 今生去年在家闲着实在无聊，想着给自己搞个平台，写点东西，或者起码把少数派上写的东西放进来，整个安身的地方，也算是对自己的成果有个交代；此外，还能兼发不适合少数派主题（尤其是翻译）、风格，或是完整度欠缺的文章。这次借助 Hugo 和 Notepadium 主题，成功搭起了博客，也放在 GitHub 上运行了，但没过多久就进入了长期空窗，网站也就搁置了。之后试图更换主题至 Academic，但研究半天未果，连 repo 也清空了。 再之后，有次与同行交流，有了不少表达欲，又加上看到了一些群里同行的公众号，顿时萌生了「我上我也行」的想法，就又开了公众号。殊不知世殊事异，新开的公众号，没有评论区权限，只能用小程序替代，既不方便，也不美观。写出来了小一万字，应声者寥寥，几如空屋独喊，无人以应。公众号对高级格式的兼容性之差也让我几近砸桌，只能拿最基本的格式应付（幸而文字本就枯燥，用不上什么「高级格式」）。种种烦恼，又让我把视线转回了博客。 某次发现了 Stack 这个主题，觉得美观、兼容性强（主要是美观，好看就够了），就打算找时间实践一下。虽说这一拖就直接从 2020 拖到了 2021，但总归是成功搭起了博客。 现在博客中只放了公众号上发的内容，之后会考虑把少数派上的文章也迁移过来。当然，微信公众号会同步更新，但有效期就不得而知了。虽然目前的博客仍无法设置评论1，但起码我可以让我写出的文字，以更养眼的样式、更自由的风格和更便利的方式（例如随处添加可跳转的外链）呈现出来，这也就足够了。 是为记。 1.主要是因为我懒。 ↩","link":"/about/index.html"}],"posts":[{"title":"每日一句｜「趋稳」","text":"本文同时发于微信公众号。 昨天听新闻，听到这么一句： 服务贸易逆差大幅减少。前 3 季度，我国服务出口降幅趋稳，出口降幅小于进口 22 个百分点，带动服务贸易逆差下降 50.0% 至 5910 亿元，同比减少 5901 亿元。 http://www.mofcom.gov.cn/article/news/202011/20201103012941.shtml 其实这个「降幅趋稳」一类的表达，之前也遇到过，但当时并没细想，就想着照字面翻过去就得了，于是造了个「decline steadily」。但这明显不对，这个英文叫「稳步下滑」，意思完全反了。 如果看服贸出口滚动数据就能发现，降幅的趋势线在逐渐拉平，稳定到某一个值。从图像上来看，就是这条曲线的斜率变「平」了。基于此，或许也可以说「the slope is turning flat」。 但说到 flat、看到曲线，就很难不想到疫情期间常说的 flatten the curve。二者虽然相似，但将 flatten the curve 用于描述「降幅趋稳」，还是有些不符合语境。如今，flatten the curve 专指疫情期间将感染人数钟形曲线拉平/压平，避免超出医疗系统能力上限。 这么看来，算数也算是译者的「基本能力」之一。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。","link":"/2020/11/04/2020-11-04-flat/"},{"title":"从「常态化防控」说开去——兼论译法的历时性与共时性","text":"本文同时发于微信公众号。 最近和同行聊天，聊到了「常态化防控工作」这个表达的处理，讨论很有收获，也拓展了对类似问题解决的思路。贯穿全年的疫情，肯定会成为 MTI、CATTI 等翻译相关考试的热门必考内容，聊聊我对这个问题的一些思考，肯定对各位备考 CATTI、MTI 的读者有一定的帮助。这第一篇文章就献给这个比较功利的目的吧。 需要先说明，翻译从来也不会有「标准答案」，没有「对」与「错」，只有是否「合适」。讨论过程中，我和同事也交流了其他的处理方法，均以语境、场合、上下文为转移，一种情境下最理想的解决方法，放在其他情境下就有可能行不通。正因如此，我才在标题中加了「历时性与共时性」这一点，顺便探讨这个说法自产生以来译法的流变，分享寻找理想译法过程中参考的英语源语表达，以飨读者。 「常态化防控」被我记挂，源于今年的政府工作报告（下简称 GWR-2020，以最终发布版为准）。GWR-2020 中关于「常态化防控」的，有这么几句： CN: 迅速扩大医用物资生产，短时间内大幅增长，抓好生活必需品保供稳价，保障交通干线畅通和煤电油气供应。因应疫情变化，适时推进常态化防控。 EN: We expanded production of medical supplies by a large margin within a short time, ensured supply and price stability of daily necessities, and maintained smooth transportation on trunk lines, as well as stable supplies of coal, electricity, oil, and gas. In response to changing covid-19 dynamics, we have adopted regular prevention and control measures in a timely manner. CN: ……在疫情防控常态化前提下，坚持稳中求进工作总基调，坚持新发展理念，坚持以供给侧结构性改革为主线，坚持以改革开放为动力推动高质量发展，…… EN: […] while carrying out regular covid-19 control, continue to follow the general principle of pursuing progress while ensuring stability, apply the new development philosophy, pursue supply-side structural reform as our main task, and draw momentum from reform and opening up to promote high-quality development; […] CN: ……下一阶段要毫不放松常态化疫情防控，抓紧做好经济社会发展各项工作。 EN: In the next stage, we will not let up on any front of our long-term fight against covid-19, nor will we lose any time in advancing China’s economic and social development agenda. CN: 在常态化疫情防控下，要调整措施、简化手续，促进全面复工复产、复市复业。 EN: While continuing to implement routine covid-19 control, we will adjust relevant measures and simplify procedures to boost the resumption of work, production, and business activities. 「常态化疫情防控」最早是 4 月 8 日的常委会上强调的，属于中文语境下的特色词汇。正因如此，英语本身可资借鉴的说法很少，只能自行创造。GWR-2020 给出的这四个译法，最突出的区别主要是前面的「常态化」处理不同，两个 regular，一个 routine，一个 long-term。如何取舍，取决于对「常」的理解： 疫情防控常态化，就是要根据国内外疫情新形势，及时完善疫情防控策略和应对举措，把重点放在外防输入、内防反弹上来，保持我国疫情防控形势持续向好态势。内防反弹，要建立健全及时发现、快速处置、精准管控、有效救治的常态化防控机制，严格落实早发现、早报告、早隔离、早治疗要求。外防输入，要加强口岸卫生检疫，优化入境流程，落实入境人员集中隔离要求，快速精准识别和管控风险源、风险点，筑牢严密防线。在确保疫情防控到位的前提下，加快恢复生产生活秩序，做好经济社会发展各项工作。 每日一词 ∣ 常态化疫情防控 regular epidemic prevention and control “面对严峻复杂的国际疫情和世界经济形势，我们要坚持底线思维，做好较长时间应对外部环境变化的思想准备和工作准备。要统筹推进疫情防控和经济社会发展工作，外防输入、内防反弹防控工作决不能放松，经济社会发展工作要加大力度。要坚持在常态化疫情防控中加快推进生产生活秩序全面恢复，抓紧解决复工复产面临的困难和问题，力争把疫情造成的损失降到最低限度，确保实现决胜全面建成小康社会、决战脱贫攻坚目标任务。” 中央为何要强调“常态化疫情防控” 要之，常态化防控的特点，就是「外防输入、内防反弹、时间较长、统筹发展」。「外防输入、内防反弹」，意味着要将防控措施「常规」化，定期做、频繁做，「统筹发展」，意味着防控措施要「日常」化，成为日常生活的一部分，保障日常生活正常运行。「时间较长」文意自明，不多解释。按照这种理解，这三种译法若放在更普适的语境中，最先排除的就是意思最狭隘的 long-term。再说回前两者，查字典（此处以 OALD 为例，仅摘录相关释义）： Regular Done or happening often Do you take regular exercise? Domestic violence is a regular occurrence in some families. [only before noun] usual I couldn’t see my regular doctor today. On Monday he would have to return to his regular duties. It’s important to follow the regular procedure. lasting or happening over a long period a regular income She couldn’t find any regular employment. Routine done or happening as a normal part of a particular job, situation or process routine enquiries/questions/tests The fault was discovered during a routine check. not unusual or different in any way He died of a heart attack during a routine operation. 从释义的角度来看，regular 涵盖了「常态化」三种可能的含义，放在哪种语境下问题都不大，routine 则只侧重「常规」，长期性、日常性体现均不足，相对来说不如 regular 好。这一点在外宣选词中也得以体现，以 China Daily 为例，结果数有显著差距： 这还不算 routine 的搜索结果中，其实并没有什么和「常态化防控」相关的结果。综合搜索结果和词义辨析，regular 其实是最好的解决方案。 说完「常态化」，再来说说「防控」。最直观的处理方法，自然是 prevention and control，查 China Daily，扑面而来的基本也都是这个结果。但也有例外，如前面 GWR-2020 中第二、四句，都只用 control。这个译法也有情可原。各国的疾控中心，虽然名字叫 Center for Disease Control and Prevention，但缩写都是 CDC，只用 control 也有情可原。 特别说明：CDC 这个缩写中没有体现 prevention，其实是有其历史原因的。美国 CDC 最早是二战时的疟疾防控办公室（Office of National Defense Malaria Control Activities, 1942; Office of Malaria Control in War Areas, 1942–46）；后来改名为「传染病中心」（Communicable Disease Center, 1946–67），缩写正好也是 CDC，1970 年改名为 Center for Disease Control，增加了非传染病防治职能，缩写保持不变；1992 年，才在其名称中添加了「and Prevention」，强调了 CDC 在疾病预防方面的职能，但缩写仍保持不变。 On October 27, 1992, CDC’s name was changed to the Centers for Disease Control and Prevention (with “CDC” still to be used as the acronym). This change was enacted by Congress, as part of the Preventive Health Amendments of 1992, to recognize CDC’s leadership role in the prevention of disease, injury, and disability. In enacting this change, Congress also specified that the agency continue to use the acronym “CDC” because of its recognition within the public health community and among the public. CDC: the Nation’s Prevention Agency 单用 control 而非 prevention and control，除了可以增加语言多样性、避免重复外，还可以为口译——特别是同传——节省时间。这次与同行讨论，提到「防控」除了一目了然的 prevention and control 和 control 外，还可以用 containment。查 OALD，第一个义项就与「病」有关： Containment the act of keeping something under control so that it cannot spread in a harmful way the containment of the epidemic 之前我却一直没想到，确实是疏忽了。一查 China Daily 才发现，这个说法 WHO 早在「常态化防控」之前就在用： At the WHO news briefing on Tuesday, Director-General Tedros Adhanom Ghebreyesus recommended countries take a comprehensive approach to contain the spread of the novel coronavirus.“COVID-19 spreads less efficiently than flu, and it can be contained,” Tedros said.The WHO also commended China for sharing its experience in fighting COVID-19 with other countries, helping them in preparation. WHO: Containment of COVID-19 is possible 虽然老谭这番话从现在的角度来看完全不符合实际，他本人现在也成了密接，正在隔离，但contain / containment 在这个语境下显然可用。「regular containment」也有具体的使用案例，并且进入下半年，出现的次数也不少： 最后，就该说说「工作」了，这也是此次讨论的重点。「工作」在翻译中属于典型的抽象填充词，实际操作中，不能简单对应为 work，而是要具体情况具体分析。结合上面的搜索结果不难看出，「工作」很多时候可以进一步抽象化，融入「防控」，直接不体现，如： 湖北防控工作到了最吃劲的时候，也是一种胶着对垒的状态。 Epidemic control in Hubei has come to a most demanding stage of tug-of-war with the disease. 防控新冠肺炎疫情表述（212）【中英】 但有时，也需要细化、具体化，常用 measures，如 GWR-2020 第一个例子。这次与同行讨论，得出的新处理办法是 protocol，即 regular containment protocol。Protocol 最常见的意思有： 「外事礼宾」的那个「礼宾」，例如外交部礼宾司，即为 Department of Protocol。这个词源自法语，本指法国国家元首在正式场合与外方互动式须遵守的礼节，以及法国外交部负责此事的部门，后泛指外交礼宾流程，也可用于其他国家的相应部门。 《京都议定书》的那个「议定书」，即 OED 定义 2：The original draught, minute, or record of a dispatch, declaration, negotiation, treaty, stipulation or other diplomatic document or instrument; esp. a record of the propositions agreed to in a conference, signed by the parties, to be embodied in a formal treaty. 互联网的「协议」，如 IP = Internet Protocol。 但除这些意思外，也可指「规范」，如 OED 所写：In extended and general uses, any code of conventional or proper conduct; formally correct behaviour.（5.c.）放在疫情语境下，也包含「诊疗方案、规范、指南」的意思，如： BEIJING — China’s health authorities have published the latest version of the “Diagnosis and Treatment Protocol for Novel Coronavirus Pneumonia.”The updated protocol, the eighth edition, noted that the patients infected by the novel coronavirus and asymptomatic infected people are the main sources of infection. China updates COVID-19 diagnosis, treatment protocol The European Union’s Agency’s for Railways (ERA), the European Commission, and the European Centre for Disease Prevention and Control (ECDC) have developed the following COVID-19 railway protocol, outlining the operational guidelines for the resumption of railway operations in Europe. This protocol reflects the current status of knowledge about the COVID-19 disease and its pandemic effect. It summarises preventive measures considered effective at the date of publication, and complements measures taken by the European Commission to support Member States in re-launching mobility and tourism across Europe. COVID-19 Rail Protocol: Recommendations for safe resumption of railway services in Europe 一处参考资料，把 measure、guideline、protocol 都集齐了，其实应该再加上一个 strategy，这样所有的备选项就都到位了，而且都有用例： Supplement D: Community Containment Measures, Including Non-Hospital Isolation and Quarantine Appendix D1: Interventions for Community Containment https://www.ncbi.nlm.nih.gov/books/NBK92450/ BEIJING — China’s State Council’s inter-agency task force has released a guideline for COVID-19 containment on a regular basis in low-risk areas during the summer months. China releases guideline for summertime regular COVID-19 containment measures in low-risk areas The Effect of Containment Measures on the COVID-19 Pandemic 需要注意，用这几个词的理据在于，「（开展）常态化防控工作」，一般指「采取常态化防控措施」「执行常态化防控指南、规范、方案 」，需要根据上下文，决定动词搭配，以及具体可用的表达。例如，protocol 虽然听上去高大上，但却是最不好搭动词的；「中国常态化防控工作取得新进展」，可能 Regular containment measures have been well implemented in China, delivering new, remarkable progress. 具体哪些动词适用哪个名词，请查阅搭配词典。 以上的这一整套探讨过程，可能并不那么「功利」，译法对应的表述也比较稀松平常。但这些步骤，都是翻译过程中必不可少的。标题中的「共时性」与「历时性」，体现在： 查阅同一主题下，译入语/目的语的规范、常用、通用表达。人类经验在很多领域都是共通的。虽然某一特定概念未必在两种语言中都有直接对应表述，但组成这一概念的相应基本组分，在两种语言中有较高的概率同时存在。探索这些组分的对应表述，即为探索翻译「共时性」的最佳体现。 查阅不同时间，同一概念表述的流变。随着人们对某一概念的认识发生变化，对其内涵有了新的阐释，或对其原有译法表示不满，译法也会随之发生变化，反映不同的措辞要求。本文对「常态化防控工作」译法的讨论，或许无法完整体现「历时性」，但未来有机会，一定会谈到相关表述。 探究译法背后的源流，剖析译法的选词，在此基础上逐渐改进，不断更新自己的「武库」，应是每一位翻译必备的基本功。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。","link":"/2020/11/01/2020-11-01-prevention/"},{"title":"About Me｜高翻有哪些阅读书目？","text":"本文同时发于微信公众号。 本文同时发于知乎。 感谢大家上期在评论区（指微信公众号——编注）所提的意见。感觉大家主要还是想看口笔译方面的东西。这类文章我心里倒是有想法，但写起来比较费劲，可能需要多一点时间成稿。这段时间自然也不能闲着，于是我就打算开一个新的类别，叫 About Me。这其实也是应之前群里提到的想法，有选择性地讲讲我学习中的一些心得经验，供后来人借鉴（我自认我的经验没什么好借鉴的就是了）。 同样，如果大家有对这个分区感兴趣的，也请在评论区（指微信公众号；博客评论区待开发——编注）提一下细化的建议，比如具体讲讲哪一方面的「经验」「心得」，这样也方便我写。 高翻本身并没有固定的「书单」，所以从文件夹里甩一个「列表」出来，这我做不到。由于高翻的课程设置，这个问题我分三部分答吧，一部分是固定书目，一部分是动态书目，再加一部分我个人推荐的书。 1. 固定书目这部分书，是无论如何都一定要读的书，属于「高翻入门必读」，甚至说「翻译实操入门必读」也不为过，最主要的目的，是尽快补齐除语言基本功之外的硬短板。 1.1 《非文学翻译》/《非文学非文学翻译理论与实践》[李长栓]这两本书放在一起说，是因为它们的精神内核是一样的，都介绍了非文学翻译的一般路径、指导原则、常用辅助工具等。（当然，更直接的原因是我只买了前者（蓝皮书），没买后者（黄皮书）。）相较来说，后者比前者在实操方面更细。但无论如何，这两本书，至少选一本，必须读完。 作为翻译，特别是非文学文本的翻译，成果质量如何，除了取决于译者自身的语言水平，还与知识面有极大的关系。这本书便花了很大的篇幅，教读者如何使用搜索、检索工具，用高效的方法检索自己需要的信息，与平行文本对比，检验译文质量。 书中还有两个算是「高翻特色」的部分：译者注和格式问题。虽然「译者注」这种教学模式非高翻独占，但高翻对其的强调程度，绝对算是国内独一份。格式问题也是高翻笔译作业的关注重点，虽然看似吹毛求疵，但能培养学生对细节的关注，对翻译这个职业，说是「百利而无一害」也不为过。 读完这两本书，对高翻笔译课的基本模式大概就有数了，可以以此为标准，指导自己的笔译练习、实践。 1.2 How to Write Clearly这是欧委会整的一本小册子，重点是 plain English，也即所谓「简明英语」。用简明英语书写，可以让文字更直截了当，更方便读者理解，直接用英文创作如此，汉译英时亦然。这本册子也是一定会要求阅读的书目，最好常备手头，每次翻译后，都对照上面的要求，逐条对照，确保译文质量够高。当然，其他机构出版的简明英语手册也可以读，选这本只是因为我们当时推荐的是这本而已。 ⚠️注意：这本书已经说得很清楚：「These are hints, not rules, and when applying them you should take account of your target readers and the purpose of your document.」简明英语不是金科玉律，只是高效沟通的必要条件。一切以文体、语境、目标读者为转移。 1.3 《中式英语之鉴》[Joan Pinkham]这本书也算是常提常新了，从词、句层面分别入手，专注于纠正中式思维「叠」出来的英文句子，和上面的简明英语手册一样，每次翻译之后，都值得读一读，排查疏漏错误。书还附带习题，便于及时练习。书虽然老，但历久弥新，依然有其借鉴意义。（借这一部分顺便一说：如果要用政府公文学习翻译，建议不要看三年之前的文本。一来时效性已过，二来这几年间，公文翻译的语言质量确实有提升。） 2. 动态书目高翻笔译课程按照不同主题划分模块，新生入学时，就会收到这一届笔译课的课程规划和模块设置，每个模块都有一系列必读和选读书目。虽然具体书目每年都会有调整，但基本的模块划分不会变动太多，必读书目也都是该领域内一些站得住脚、经得起检验的经典作品。有的阅读书目可能只列出英文，原因之一是，泛读确实是一项非常重要的技能，多读些英文的「大部头」，可以提高阅读速度、理解能力以及短时间内抓取信息的能力。此外，读英文书时，可以搭配同领域的中文书一起阅读，方便积累双语表达，但切不可仅读中文书，否则读英文书也没了意义。 2.1 宏观通识 Principles of Economics [N. Gregory Mankiw] United Nations: A Very Short Introduction [Oxford Very Short Introductions] Mankiw 的 Principles of Economics 大名在外，快速入门还是值得一看的。Oxford Very Short Introductions 系列的其他书也值得看看，记得有气候变化等领域的，内容浅显易懂，便于了解相关主题。此处写这本 United Nations: A Very Short Introduction，只是因为这是高翻传统（联合国译训班的传承），英译汉必定会有联合国文件的翻译，因此有必要了解联合国组织、日常运行相关的知识。其他国际组织的相关知识也有必要了解。 2.2 科技 Scientific American 有关前沿科技的 For Dummies 系列 Scientific American 是杂志，网上想找就可以找到，适合泛读，目的是了解科技进步和前沿领域；For Dummies 系列则适合选择一个领域之后，快速入门，了解该领域的基本内容和框架。 2.3 金融财会 Finance For Nonfinancial Managers [The Mcgraw-Hill 36-Hour Course] 如果进了企业做 in-house，或者干脆改行进企业做财务相关，一定会经常与会计、资产负债表打交道；即便不然，懂点会计、读懂资产负债表也比较重要，毕竟这些可以看作是金融的语言。 2.4 艺术 The Story of Art [H. Gombrich] 这本算是「巨部头」了，页数很多，需要慢慢读，但确实经典。 2.5 法律 The Rule of Law [Tom Bingham] Law: A Very Short Introduction [Oxford Very Short Introductions] 《法律英语综合教程》[杨俊峰、屈文生] 《法律英语：中英双语法律文书制作》[Preston M. Torbert] 这类书有两个目的。第一是快速了解法律相关的知识，第二是尽快掌握法律语言的表达。书里还包括一些很重要的知识，例如法律文书中情态动词的使用，工作上也帮了一定的忙。 3. 个人推荐上面的书都是按照笔译课的课程设置推荐的。还有一些书，我个人认为应当读，列在下面。 3.1 语言基础 The Elements of Style [William Strunk &amp; E. B. White]。这本书大名鼎鼎，篇幅也不长，一个小时一口气就能读完，同样是适合放在案头，时常翻阅的参考书。里面关于词语用法的内容，值得反复咀嚼。 The Oxford Guide to Style，或其他 style book。如果忘记了某个标点怎么用、日期数字怎么表达，就看这类书吧。同样，案头常备、常翻。 中文流畅的书。毕竟英译汉也是翻译的一部分，中文的功底也不能落下。引我注意这个问题的，是辛德勇老师的《制造汉武帝》，文笔上乘；之后读了史景迁的《太平天国》，译笔译风实乃吾辈楷模。这类书不固定，可以按照自己的需求选择。 3.2 主题细分除了前面提到的应读经典书目，还有一些属于「临时抱佛脚」类的书，也应当看。每接到一个具体的翻译任务，相关领域的材料应当收集下来以备参考。例如，有一次作业中涉及了公孙龙的「指物论」，我跑到国图查了《汉英中国哲学辞典》，查了知网，查了各种各样的资料，最后才汇总成一段为自己译法声辩的文字。这中间经手的所有资料，都值得留存下来，以备日后反思，或为自己辩护。这方面很难说有哪本「具体」的书值得我推荐，只能说得遇且遇且珍惜。 3.3 翻译理论、研究 Introducing Translation Studies: Theories and Applications [Jeremy Munday]。这本算是我的 personal favorite，条理够清晰，重点词有标注，算是本相当不错的导论书。中文的翻译理论书可以备一本，但不能仅看中文。 Basic Concepts and Models for Interpreter and Translator Training [Daniel Gile]。这本是口译研究入门的经典，口译研究、口译训练、口译教学必读的提纲挈领之作，精力分配模型、IDRC，都是这本书提出来的。 读完这两本之后，可以按自己的需求，找具体领域的作品去读。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。","link":"/2020/11/12/2020-11-12-gsti-books/"},{"title":"每日一句｜强调","text":"本文同时发于微信公众号。 今天不是讲个别的词，来个句子。 事情的起因是周五快下班，看到中国日报双语新闻推了一篇 文章，顺手点进去一看，一开头写的是： 近日，澳媒提醒本国和其他国家记住中国的一句古老成语，“有时你必须杀鸡儆猴”。并称，问题是在这句成语里，对于澳大利亚而言，下场很惨的是那只鸡。 …to remind other nations in our region of the old Chinese idiom that, “Sometimes you must kill the chicken to scare the monkeys.”The problem for Australia is that, in the terms of this idiom, it is the chicken that always ends up in a very bad place. 先看英文，大致一扫，it is … that …，像是个强调句。再一看中文，也确实是个强调句。但再仔细一读中文，意思就不太对了。「对于澳大利亚而言，下场很惨的是那只鸡」，这前后两句完全不挨着。「杀鸡儆猴」，「杀鸡儆猴」，「鸡」都「杀」了，谁比较惨还是个「问题」吗？ 这篇文章的 原文在此。大概就是说澳大利亚管控与中国分歧的方式太拉胯了，气得中国现场表演「杀鸡给猴看」。选段出现在原文最末尾： It [Australia’s handling of this very complex issue] has also allowed China to be ‘deeply offended’, by our very public comments, and also provided Beijing with a self-serving opportunity to remind other nations in our region of the old Chinese idiom that, ‘Sometimes you must kill the chicken to scare the monkeys’. The problem for Australia is that, as we reflect on this idiom, it is the chicken that always ends-up in a very bad place. 所以捋一捋这句话，顺便做个填空题：中国被澳大利亚气到了，所以决定给区域国家表演个杀鸡儆猴，但对澳大利亚来说，问题在于，________________。这个空里填： A. 下场很惨的是那只鸡 B. 澳大利亚（才/就）是那只下场很惨的鸡 如果从上下文文意通顺的角度出发，答案显而易见，肯定是 B。作者的意图，肯定也是想敲打澳政府，摆正自己的位置，再这么跳就真的是被杀的那只鸡了。鸡被杀，就会死，就很惨，不言自明，何必强调？基于此，再回看这个句子，不难发现，这其实不是个强调句，就是个简单而普通的代词（而非形式主语）作主语的「主系表 + 定语从句」的结构，其中 it 指这句话一开头 the problem for Australia 的那个 Australia。 所以说，翻译的时候不能光看英文是个啥结构。看到以为是强调句（毕竟 it is … that … 要素齐备），就自动翻译成了强调句，这是「语法书」式的翻译。翻译出来的东西，自己再读一遍，看看说的是不是人话？行文是不是正常人的逻辑？做到这一点，就能避免很多低级而啼笑皆非的错误。 但说实话，这句话确实很有欺骗性，读来读去，甚至有种两说皆可的感觉。其实，也不能太责怪中国日报公众号的小编，因为这显然是原文写作的问题。如果把 that 换成 which，或是换种表达方式，就不会引起歧义了。至于我为什么说作者水平不行，看这句话： In recent months Prabowo has also visited the US with a reciprocated visit by US secretary of State Mike Pence. 不知道彭斯自动降了好几级，心里作何感想。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。","link":"/2020/12/13/2020-12-13-emphasis/"},{"title":"读书｜打倒外国人口中的「中式英语」！","text":"本文同时发于微信公众号。 有天一早，看见群里正如火如荼地批判「中式英语」。仔细一看，原来是这么一句： CN: 人民生活水平、居民收入水平、社会保障水平迈上一个大台阶。 EN: The people’s living standards, individual income and social security have improved significantly. 有人说，这句中的加粗部分不对，是「中式英语」，理据见《中式英语之鉴》（下简称《中》）： A: living standards for the people in both urban and rural areas continued to rise. B: living standards in both urban and rural areas continued to rise. [The notion of living standards applies only to people.] （Pinkham, 2000:3） 《中》是本好书，之前我也推荐过。【链接】但群里的矛头指向「living standard for the people」是中式英语，让我着实有点费解，因为与之性质相同的表达「people’s living standard」我也常用，从没想到自己居然犯了这么大的错误。出于对自己能力的不信任，我上网搜了一下，不搜不知道，一搜吓一跳，这个世界，竟被「中式英语」悄悄占领了！ The coronavirus crisis will wreak “lasting damage” on people’s living standards across the world and taxes on the rich and on companies may have to rise to address this economic harm, the IMF has warned. Pandemic will cause ‘lasting damage’ to living standards, IMF warns The Poverty and Social Exclusion explores poverty by directly examining people’s living standards and provides full details of the PSE UK research project. Living standards High cost of living adds pressure to people’s living standards, which may in turn impact on their wellbeing. This indicator will measure cost of living in the ACT via the Consumer Price Index, reporting on changes in the price level of a range of consumer goods and services. […] In May 2011 Treasury released a working paper outlining what it meant by living standards in its vision “working for higher living standards for New Zealanders”. … High inflation is costly for the economy, increasing economic uncertainty and lowering people’s living standards by undermining the value of their purchasing power. There is a broad range of factors that impact on inflation including monetary, regulatory policy, market structures and fiscal policy. Improving the Living Standards of New Zealanders: Moving from a Framework to Implementation (PDF document) Income inequality has long been an important issue in welfare economics. However, solely looking at income tells only part of the story about the differences in people’s living standards because income does not reveal information about the cost of living, i.e., the actual purchasing power of a person’s income. Income and Living Standards within the Eighth District 看看这出处，不光是 Financial Times，就连五眼联盟，都有四只眼造反了！再一看 COCA，居然 Foreign Affairs、CNN 都跳反了！ 这样怎么能行！我们要站起来，联合一切可以联合的朋友，共同抗击「中式英语」！ 玩笑归玩笑。《中》为何在这个问题上「翻了车」？要想解决这个问题，先要回顾《中》成书年代，中国英语使用者，特别是翻译人员的（可以料想的）语言、翻译水平。这本书成书是 1999 年，那时的中国互联网尚未普及，语文课本上还有《我家跨上了信息高速路》这篇课文，向大家介绍什么是互联网。除此之外，获取外国原版刊物更是几无可能。这种种困难，注定了那是的翻译人员，几乎没有合适的资源，确定自己的翻译是否地道。 此外，彼时专业翻译的教学、培养虽说不是白纸一张，但也只是刚刚起步，「小词典」式翻译方法，恐怕还是最常见的套路，故而「逢词必译」恐怕是再常见不过的常态。但正所谓「过犹不及」，中英文差别甚大，把中文的每个词都逐一翻出，自然不可能得出地道的英文。《中》开篇就讲赘词（unnecessary words），在「赘名词」下指出，这些词之所以成为赘词，是因为「their sense is already included or implied in some other element of the sentence」（3）。如书中给出的例句，「in both urban and rural areas」，也即「城乡」，本就是以「人的居住地」为视角进行的划分，自然包括了「人」的要素在内，故不需在强调「人」，for the people 也就成了赘词。 但话虽如此，现在这些用 people’s 的例子又该如何解释？仔细观察不难发现，这几个句子都有其特殊性，用 people’s 效果更好。 上述几个句子中，有的句子前文用了 people’s，后文一定会对 people’s 有所指称。 如「High inflation is costly for the economy, increasing economic uncertainty and lowering people’s living standards by undermining the value of their purchasing power. 」「High cost of living adds pressure to people’s living standards, which may in turn impact on their wellbeing.」两句中，their 就是对 people’s 的指称； 「However, solely looking at income tells only part of the story about the differences in people’s living standards because income does not reveal information about the cost of living, i.e., the actual purchasing power of a person’s income.」一句中，后文 person’s 是对前文 people’s 的呼应。 添加 people’s 也能理顺句子气息，让句子更易读、更美观。 如「The Poverty and Social Exclusion explores poverty by directly examining people’s living standards and provides full details of the PSE UK research project.」如果摘掉 people’s，那句子就成了「examining living standards」，两个现在分词连用，读起来、看起来都不够美观舒适，加上有助于调整节奏。 而《中》在很大程度上，反映的只是作者自身的语言观、翻译观和用语习惯，难以体现英语使用的全貌。上面的分析也能看出，别人指出的「赘词」，其实未必赘余，有时反而有其功用。若完全按照书本所写，按图索骥，那才是成了「死读书，读死书」的典范。作者自己在前言中就写道：「Translation is not a science but a craft（但这句话仍值得商榷）, and craftsmen in any field may have different opinions as to the best solution to a given technical problem.」条条大路通罗马，若是在去往罗马的路上，无视文体、上下文对文字风格的要求，矫枉过正，到的可能也就是个假罗马。在其他与之类似的问题上，例如「简明英语」（plain English）的使用，也需要注意类似的原则：「These are hints, not rules, and when applying them you should take account of your target readers and the purpose of your document.」 再倒回头，开头提到的那句话，真的就金身不破吗？这里我不具体阐述，只提几个点，请大家各自思考，各自决定。 这篇文字的出处是？这不是问出自哪本翻译教材，而是原文原始的出处。这个问题之所以重要，是因为搞懂了出处，就搞懂了作者，因而能搞懂目标读者和文体文风，对做出取舍是非常重要的参考标准。 「人民」和「居民」如果按照《中》的观点，意思一致，能否合并？这就体现出如何理解原文中「人民」这个词。要知道，在中文语境下，「人民」是一个政治概念，有其政治意涵，这从前面带的定冠词就能看出。 句中说三个东西「迈上一个大台阶」，用了并列句式，但这三个东西能并列吗？这考察的是如何理解生活水平、居民收入和社会保障三者的关系。有没有可能第一个元素包括后两者？还是只是单纯的并列？还是差别太大，放到一个句子里本就不合适？这几个问题的答案又该以什么为依据去判定？ 当然，对于这一句话，还能提出其他疑问。这些疑问也只是用于启发，并不是说我用了反问，答案就一定反着来。至于答案到底如何，就请各位慢慢思考吧。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。","link":"/2020/12/12/2020-12-12-chinglish/"},{"title":"每日一句｜「积极」","text":"本文同时发于微信公众号。 之前写 xxxx 的时候，查了一些 CDC 的资料，在 CDC 网站上看到这么一句： CDC is aggressively responding to the global outbreak of COVID-19 and community spread in the United States. Learn more about what we’re doing to protect and prepare communities. https://www.cdc.gov/about/default.htm 一下子就来了精神：「这个 aggressively，不正好可以对应『积极』吗？」于是，不妨用这篇文章，大概谈谈「积极」这个有些 tricky 的词，怎么处理才好。 首先，要先明确「积极」有哪些意思。查《现代汉语词典》，「积极」有两个意思： 【积极】jījí [形] ❶ 肯定的；正面的；有利于发展的（跟「消极」相对，多用于抽象事物）：起～作用｜从～方面想办法。❷ 进取的；热心的（跟「消极」相对）：～分子｜他对于社会工作一向很～。 看完定义就不难发现，「积极」至少有三种可能的解决方法。第一种是显然处理为定义❶的，第二种是显然处理为定义❷的，第三种是与其他词结合处理，不直接体现的。前两种均指「积极」本身单独对应某一个英文单词。接下来，分别对这三种情况进行讨论。 显然处理为定义❶ 【例 1】 2013 年我访问中亚期间，提出共同建设丝绸之路经济带的倡议，得到包括乌兹别克斯坦在内国际社会广泛支持和积极响应。 During my visit to Central Asia in 2013, I put forward the initiative of jointly building a Silk Road Economic Belt. This idea received broad support and positive response from Uzbekistan and around the world. 【例 2】 3 年来，沿线各国聚焦政策沟通、设施联通、贸易畅通、资金融通、民心相通，不断深化合作，已经在多个方面取得积极成果。 Over the past three years, countries along the route have focused on enhancing policy communication, infrastructure connectivity, unimpeded trade, capital flows and people-to-people exchange. Our cooperation has deepened and produced positive outcomes in diverse fields. https://yizhiyoudao.kuaizhan.com/80/66/p425896251c5a8c 这两例性质相同，都是表达「正面」的含义。仔细观察，英文均采用「形容词 + 中性色彩名词」的结构。常用 positive 解决。 显然处理为定义❷ 【例 3】 “一带一路”建设、亚洲基础设施投资银行都是开放的，我们欢迎沿线国家和亚洲国家积极参与，也张开臂膀欢迎五大洲朋友共襄盛举。 We welcome all countries along the routes and in Asia, as well as our friends and partners around the world, to take an active part in these endeavors. https://yizhiyoudao.kuaizhan.com/50/61/p42379649418148 【例 4】 我们要继续支持“上合组织－阿富汗联络组”工作，积极为政治解决阿富汗问题贡献“上合智慧”。 We need to continue to support the SCO-Afghanistan Contact Group and actively contribute SCO’s wisdom to the political resolution of the Afghan issue. https://yizhiyoudao.kuaizhan.com/37/44/p564567855689b0 这两例都表示「主动」采取行动的意思，故用 active 处理，有时也可用 proactive，但proactive 比 active 更 active，有「先发制人」「防患未然」的意思，如无较高把握，慎用。 结合处理结合处理的，其实也分定义❶和定义❷： 【例 5】 目前，已经有 60 多个沿线国家和国际组织对参与“一带一路”建设表达了积极态度。 Currently, more than 60 countries along the routes and international organizations have shown interest in taking part in the development of the Belt and the Road. https://yizhiyoudao.kuaizhan.com/50/61/p42379649418148 这一句显然是定义❶，「表达积极态度」在这句话中，就是「想要参加」，有兴趣，因而如此处理。 【例 6】 截至目前，共有 70 多个国家和国际组织积极参与“一带一路”建设，…… To date, more than 70 countries and international organizations have joined the initiative. https://yizhiyoudao.kuaizhan.com/80/66/p425896251c5a8c 这一句则显然是定义❷。「积极参与」即「主动参与」，主动语态的 join 本身即可表达出这个意思。需要注意，这一句与例 3 虽然形式相似，但意义有不同。例 3 中，有关国家尚未参与，属劝诱式话语，为调动其积极性，应当凸显「积极」，强调主动参与的意思；例 6 则描述既成事实，可看作与例 3 一体两面。若是为了宣传自己「积极」做了某事，在描述既成事实的语言中明晰化「积极」倒也未尝不可，但这毕竟是描述别人做的事，不宜喧宾夺主，融入处理更佳。 【例 7】 上合组织成立 17 年来，安全、经济、人文等领域合作取得丰硕成果，为维护亚欧大陆和平稳定、促进地区发展繁荣作出了积极贡献。 Since its inception 17 years ago, the SCO has achieved fruitful results in security, economic, and people-to-people exchanges and cooperation, and contributed to peace and stability of the Eurasian continent and development and prosperity of the region. https://yizhiyoudao.kuaizhan.com/37/44/p564567855689b0 若说到 contribute / contribution，在此语境下本来就是 add/support 的意思，无所谓「positive contribution / negative contribution」之别。「积极贡献」，即是「贡献」。这一例与例 4 的关系，与前面例 6 与例 3 的关系类似，都是一方描述劝诱、一方描述既成事实。此外，例 4 中的「积极」取定义❷，也与例 7 不同。 小小总结一下，无论定义❶还是定义❷，明晰化处理，基本用在采用中性色彩词作中心词，需要附加修饰成分说明中心词的时候。英文不似中文，有时一词即可表示中文多词堆叠的含义，或中文词语的意思，已经通过其他语法手段体现出来，一一对应或合并处理，均需要考虑实际情况，避免词义重复或缺失。 再说回开头的 aggressively，查 OALD： Aggressive acting with force and determination in order to succeed an aggressive advertising campaign A good salesperson has to be aggressive in today’s competitive market. 在这个义项下，包含了 force and determination。虽然英文中拿这个对应「积极」「有为」确实很贴切，但毕竟包括了 force，加上 aggressive 的本义包含「侵略性」，不适合外宣场合使用，同样需要慎重考虑。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。","link":"/2020/11/04/2020-11-04-aggressive/"},{"title":"每日一句｜「文明」","text":"本文同时发于微信公众号。 逛 PIIE 的时候，看到一篇讲世行的，里面提到了中国，就打开看了看。读着读着，读到一句： As incomes in China are rising, its citizens are increasingly concerned about the environment, and leadership is interested in implementing policies consistent with the ideal of ecological civilization. 我整个人都激灵了一下。要知道，大家接受的翻译教育（if any）肯定都强调过，「文明」在中文中，不能直接等于表示人类社会发展阶段的 civilization，有时更可能是「用来指示一种社会现象的正向发展及其发展的水平或高度」。如《现代汉语词典》对「文明」的定义： 【文明】wénmíng ❶ [名] 文化①（人类在社会历史发展过程中所创造的物质财富和精神财富的总和，特指精神财富，如文学、艺术、教育、科学等。）：物质～。❷ [形] 社会发展到较高阶段和具有较高文化的：～人｜～国家。❸ 旧时指由西方现代色彩的（风俗、习惯、事物）：～结婚｜～棍儿（手杖）。 「生态文明」若按此观，指的就是生态环境保护得好、水平高，或者在这方面做了很大努力，成效很好。用 progress 等更合适，如「生态文明建设」译为 promotion of ecological progress，「生态文明制度」译为 system for ecological improvement。 有篇文章讲这一点讲的很好，大家可以在后台回复「文明」获取（不幸的是，这片上有我的批注，较有碍观瞻；如果学校可以用知网，文章篇名为《社会制度、意识形态关键词“文明”“精神”英译探析》，作者杜争鸣（下简称「杜文」，大家可以自行下载阅读。 但看到这一处英文，我就又去网上搜索了一番，找到了不少与杜文相抵触，而采用 ecological civilization 的文段，如： Against the backdrop of climate chaos this book explores the vision of an ecological civilization by asking eight key questions and drawing answers from relational philosophies, the ecological sciences, systems thinking, network theory, .. What Is Ecological Civilization: Crisis, Hope,and the Future of the Planet (Philip Clayton &amp; Wm. Andrew Schwartz) An immediate turn in the direction of a global ecological civilization is therefore the only real option. It is impossible to foresee what such a civilization will look like that will be a work in progress for future generations to shape. Abundant Earth: Toward an Ecological Civilization (Eileen Crist) 现在看来，我国的对外宣传工作已经比较到位了，外国人也接受了我们的「生态文明」的逐字对译。杜文应该算是过时了，今后应该可以更放开手脚一些了。 你以为你以为的就是你以为的，而且我告诉你的就是你应该以为的？你以为现在就可以放开手脚，随便用 civilization 了？ 不知道大家在读上面的引文时，有没有感觉不对劲？比如说，引文中所说的 ecological civilization 到底是什么意思？要回答这个问题，我们先来看一段意思绝对符合中文语境的引文，其中用到了 ecological civilization： Ecological Civilization part of former President Hu Jintao’s scientific outlook on development and harmonious socialist society … It emphasizes paying attention to the environmental consequences of economic growth and supports giving priority to sustainable development.（有改动） Politics in China: An Introduction (William A. Joseph) 这一条既有中文的语境，用的又是字面直译的表达，乍看之下没什么问题，也能用作「生态文明 = ecological civilization」的证据。但问题在于这本书的性质，以及这一段文字的性质。这本书看标题，是一本严肃的学术著作，探讨的是非英语母语地区的情况，对于相关的术语，自然以字面直译为最佳，这样不会导致过度发挥，以致偏离源语含义。但这样产生的译文，未必处处都符合源语的语境。 再说语境。这段文字选自该书的索引部分，也就是将书中出现的概念，按首字母顺序排列的查阅表。此处「生态文明」作为词头，自然不可能罗列出符合各类语境的一切可能用法，只能如上条所说，选取最直接、最对应的翻译方法。细读也会发现，后文只是在对词头下定义，二者完全脱离了联系，自然，解释部分也就完全不需考虑词头的语境。因此，ecological civilization 只能说完美符合本书写作的目的，至于是否符合实际使用的需要、能否传达各类文件报告中「生态环境」的含义，则不在该书作者的考虑范围之内。 上述考察说明，在查证表达时，不能看到字面符合自己的想法，就认定字面表达放之四海而皆准，必须要确保表达和语境相符，才能审慎选用。那既然如此，我们就不得不考察 ecological civilization 这个搭配在母语者口中 / 笔下，到底会用在什么样的语境中。查询 COCA 结果如下： 查询 iWeb 结果如下： Google Books ngram 的部分结果包括： The planet is no longer the one the ancestors knew, or even the one our living elders grew accustomed to and loved. If the death-renewal-rebirth transition happens this time, it will of necessity find its way from industrial civilization to ecological civilization or, in Thomas Berry’s phrase, from “technozoic age” to an “ecozoic”one. Earth-honoring Faith: Religious Ethics in a New Key (Larry L. Rasmussen) The new form of civilization we so urgently need will require new ways of thinking and relating –ones that are more socially responsible, ecological, “mindful,” and coherent–and new ways of educating ourselves. The essays in this volume describe features of an emerging, relational vision of civilization and some of the educational practices it suggests. Educating for an Ecological Civilization: Interdisciplinary, Experiential, and Relational Learning (Marcus Ford &amp; Stephen Rowe) Organic Marxism shows why the situation is not hopeless, however. The vast majority of humans favor sustainable systems and lifestyles. With this growing support, it’s possible to begin laying the foundations for a new, ecological civilization on this planet. … Without a planetary crisis, the rich would remain in power. As we approach the planet’s limits, however, there is no other option but to shift to an organic, ecological civilization. Clayton and Heinzekehr show how scientists and economists, farmers and small business people, artists and religious leaders are coming together around the globe, building communities for the common good. Organic Marxism: An Alternative to Capitalism and Ecological Catastrophe (Philip Clayton &amp; Justin Heinzekehr) 语料库的数据，刨除涉及中国的、讲中国的，最后也剩不了几条结果。仅有的结果中可以看出，ecological civilization 基本是整体作为一个完整的概念提出，而非附加「建设」「制度」等词构成偏正结构。这意味着，在此类语境中，ecological civilization 意味着 civilization that’s ecological / eco-friendly，侧重点在 civilization 上，描述的是某一具体的社会形态。而中文的「文明」可能是虚位词，即将「生态」作为与「物质」「精神」相对的另一个范畴，添加范畴词「文明」保持对仗，但范畴词本身不表示任何含义，或如杜文所说，表示「社会现象的正向发展及其发展的水平或高度」的意思。 如此看来，ecological civilization 不应作为中文语境下「生态文明」的对应词。但真的如此吗？ 生态文明建设成效显著。大力度推进生态文明建设，全党全国贯彻绿色发展理念的自觉性和主动性显著增强，忽视生态环境保护的状况明显改变。生态文明制度体系加快形成，主体功能区制度逐步健全，国家公园体制试点积极推进。全面节约资源有效推进，能源资源消耗强度大幅下降。重大生态保护和修复工程进展顺利，森林覆盖率持续提高。生态环境治理明显加强，环境状况得到改善。引导应对气候变化国际合作，成为全球生态文明建设的重要参与者、贡献者、引领者。 We have made notable progress in building an ecological civilization. We have devoted serious energy to ecological conservation. As a result, the entire Party and the whole country have become more purposeful and active in pursuing green development, and there has been a clear shift away from the tendency to neglect ecological and environmental protection. Efforts to develop a system for building an ecological civilization have been accelerated; the system of functional zoning has been steadily improved; and progress has been made in piloting the national park system. Across-the-board efforts to conserve resources have seen encouraging progress; the intensity of energy and resource consumption has been significantly reduced. Smooth progress has been made in major ecological conservation and restoration projects; and forest coverage has been increased. Ecological and environmental governance has been significantly strengthened, leading to marked improvements in the environment. Taking a driving seat in international cooperation to respond to climate change, China has become an important participant, contributor, and torchbearer in the global endeavor for ecological civilization. 十九大报告偏偏剑走偏锋，这一段四个「生态文明」，三个用了 ecological civilization。但同样的趋势，在 2017（同年）、2018、2019、2020 四年的政府工作报告中并未出现： 六是加强生态文明建设，绿色发展取得新进展。（GWR-2017） Sixth, we strengthened ecological conservation and made fresh progress in pursuing green development. （八）坚持人与自然和谐发展，着力治理环境污染，生态文明建设取得明显成效。（GWR-2018） Eighth, with a commitment to achieving harmony between human and nature, we have taken major steps to address pollution, and achieved notable progress in ecological conservation. ……生态文明建设成效显著。（GWR-2019） Marked achievements were made in ecological conservation. 实施重要生态系统保护和修复重大工程，促进生态文明建设。（GWR-2020） We will carry out major projects for protecting and restoring key ecosystems to promote ecological conservation. 甚至再往前算，十八大报告也未使用 ecological civilization： 生态文明建设扎实展开，资源节约和环境保护全面推进。 Solid steps have been taken to promote ecological progress, and comprehensive progress has been made in resource conservation and environmental protection. 但既然十九大报告如此使用，肯定背后有其道理，在此不妨猜测一二： 用 ecological conservation 一来借鉴外部已有的表达，让对外传播更地道，同时，外部表达可以如实传达「生态文明」的字面意思； 对这个词的内涵有了新的理解与界定，过去不敢体现，现在敢于通过英文表达出来，体现主动把握对外宣传话语权的趋势。 这两个因素，或还可叠加另一重考虑：十九大报告与其他文本相比，最显著的特点在于「生态文明」单独占了一整段，且这一整段反复强调「生态文明」「生态环境」等概念，并没有过多涉及污染治理等关联概念。采用 ecological civilization，可以凸显「文明」二字的分量。 当然，上述「理据」都是猜测，具体的决策过程，恐怕需要亲历者才讲得清楚。况且，civilization 这个词能不能用、什么时候用，也远不止「生态文明」这一个场合。其他词，例如「精神文明」（在杜文中也有涉及），也需要另作观察，再下决定。至于「精神文明」的处理方法究竟几何，就交给各位读者调查判断吧。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。","link":"/2020/12/21/2020-12-21-civilization/"},{"title":"每日一句｜「主义」","text":"本文同时发于微信公众号。 最近读了 Prasad 的 The Land of Too Much，这本书确实是不可多得的好书，但中译本实在不甚理想。仅摘一段： 本书旨在将显示了美国强政府干预的历史学研究与对这些问题做出回答的比较政治经济学结合起来。我还企图说明，号召大家关注美国式的政府干预，将更好地理解美国的发展过程，包括为何与其他发达的工业化国家相比，美国会有更多的贫困——而正是这一问题困扰了城市和中产阶级进步主义改革者们一个多世纪。将注意力放到这些问题上，能更加令人信服地解释为何美国的公共福利如此不发达。另外，考察在美国这些方面的因素出现的历史，有助于解释 20 世纪 70 年代到 80 年代新自由主义的兴起。而且，结合历史而对比较政治经济学进行适当的理解，对理解金融危机的扩展至关重要。 如果大家感兴趣，可以去找这段原文，看看到底什么叫「偷换主语」。不扯这么多了，总之，被中译本伤害后，我扭头直接去读了原文，明显比读这个需要再做一次加工的译本要舒服许多。阅读过程中，发现了一个有趣的现象，见下面两段： David Vogel summarizes his findings on regulation as, “The United States remains exceptional, but . . . this exceptionalism is precisely the opposite of what much of the literature on American politics would have led one to expect” but cautiously adds “at least with respect to this dimension” (Vogel 1986, 28). Prasad, 23 But if the United States is as interventionist as other countries then it may be that no capitalist state has survived, or can survive, without extensive state intervention. Prasad, 24 -ism / -ist 这个词缀相信大家都不陌生。「高举中国特色社会主义伟大旗帜」就是 hold high the banner of socialism with Chinese characteristics；「社会主义核心价值观」就是 core socialist values。似乎 -ism / -ist 就等同于「主义」。但回到上面两个例子，从一个普通词（exceptional、intervention）到某种形似「主义」的东西（exceptionalism、interventionist ），二者的呼应不禁让人思考：「主义」到底是什么？或者说，-ism / -ist 表达的除了「主义」这个已经变得抽象、空洞的词语之外，到底是什么内涵？ 先回答第一个问题。「主义」一词本是中文固有，后来日语借去对译 principle 一词，之后再引申为词缀，反向输出，以至今日。关于这段历史，可以阅读 这篇文章。根据《现代汉语词典》，「主义」是： 【主义】zhǔyì [名] ❶ 对客观世界、社会生活以及学术问题等所持有的系统的理论和主张：马克思列宁～｜现实～｜浪漫～。❷ 思想作风：本位～｜自由～｜主观～。❸ 一定的社会制度；政治经济体系：社会～｜资本～。 也就是说，能成为「主义」的，必是一种体系性较强的理论、观点，或是一套成体系、模式明确的行为方式。 -ism / -ist 是什么意思？再来看第二个问题。-ism / -ist 的源流与含义，OED 给出了较为清晰的分类梳理和解释，此处不全文列出，仅摘取较为重要的部分： repr. F. -isme, L. -ismus, a. Gr. -ισµός, forming nouns of action from verbs in -ίζειν, e.g. βαπτίζειν to dip, baptize, βαπτισµός the action of dipping, baptism. An allied suffix was -ισµα(τ-), which more strictly expressed the finished act or thing done, and which in some cases is the source of modern -ism. […] Hence the n. in -ισµός had the sense of acting or doing like, siding with, adhesion to, or speaking like the people in question; […] On the type of these, -ισµός, -ismus, became the ordinary ending to form names of religious, ecclesiastical, or philosophical systems; […] 上面提到的那篇文章讲到，随时间推移，日文用「主義」来对译 -ism / -ist 后缀，这组对译关系渐渐就形成了，至于反向输出，则是后话。究 -ism / -ist 本义不难发现，这一词缀本源指已完成的动作，后来指一套行为模式，再后来用以表述思想流派，是一个典型的从一般到特殊的过程。而随着人类认识不断变得复杂，令人印象最深刻的，往往不是「一般」情形，而是提炼过的「特殊」情形，这也是为什么大家对 -ism / -ist 最熟悉的词义，偏偏是意思最抽象，但形式最固定的「主义」。-ism / -ist 因而得以借着「主义」的名堂大行其道，但实际使用中，仍可见发挥 -ism / -ist 本来意思的例子——文首提到的 Prasad 的文字，便是几例。 但回首一想，很多我们司空见惯的「主义词」，又何尝不是如此呢？什么是「例外主义 / exceptionalism」？就是把某某物、某某事当例外处理的一套行事作风和逻辑。什么是「干涉主义 / interventionism」？就是干涉他方。因此，「主义 / -ism」在此除了徒增抽象概念，并没有起到太多作用，只是进一步名词化的工具（对于 -ist，则是进一步形容词化）。与其让文字变得貌似很高深，倒不如还原其本意，不必言必称「主义」。直白的文字，才更有力量。当然，这也不代表翻译时见到 -ism / -ist 就一定要避开「主义」。有的约定俗成的说法，仍应予以尊重和保留。 这一通分析下来，最重要的借鉴有二： 见到英文的 -ism / -ist 时，虽然可以不过脑子直接「主义」扣上，但也要多想想背后是什么意思。其实，对于任何想当然的情形，都应如此处理。有时多想一步，便能避开无意间迈入的陷阱（比如看到 it is … that … 便认为是强调句式，见 [每日一句｜强调](/post/2020/emphasis/index.md），或是改善自己的表达。 见到中文的「做派」「做法」等较不好处理的范畴词时，也可以考虑 -ism / -ist。细读英文，归根结底还是为了提升汉译英的水平。英文这种借助词缀变化实现的语言效果，正是中文难以直接直接表达出来的；而中文惯用的范畴词，直接在英文中对译效果并不会太好。此时，便可另辟蹊径，多考虑这样的处理方法，解决棘手的问题。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。","link":"/2021/01/19/2021-01-19-ismus/"},{"title":"About Me｜我是怎么读 GWR 的","text":"本文同时发于微信公众号。 今年的「两会」如期召开，2021 年的政府工作报告（GWR）也正式公开亮相。对于翻译学习者，GWR 一定是学习阶段绕不过去的一座大山。动辄上万字的文本中囊括了全年可能遇到的重点表述，有些也会成为 CATTI 这种标准化测试的必考项目；译文对流水句划分层次的思路，也是翻译学习者必练的基本功。GWR 涵盖的领域包罗万象，广度远超各类白皮书，算得上是「万金油」学习材料；同时浅尝辄止，能帮助学习者在各个领域培养基本认知。 每年 GWR 一发布，网上就会有不少文章「精读」之。这类文章的做法，无非是逐段乃至逐句列出中英文，从里面标出作者认为重要的词句，在旁边列出来云云。这样的努力当然值得认可，对于入门者来说也够简单直接，但个人管窥，这种读法至少有两大缺陷。 第一，仅着眼微观，对宏观把握不足。关于翻译最小单位这个问题，学界已经有过很多争论。但就最终效果而言，自然是视野放得越大、越远越好。理论上，有学者认为应该把翻译单位确定为语篇（discourse）层面。而在实践中，首先要关注同一表述在文内不同地方表述的异同。翻译不是逐字对照、一一对应的「小词典」式工作。同一表述在不同上下文中出现，需要不同的处理方法，确保文字连贯通顺易读。对这些地方有所观察，而不仅仅局限于「某个『专名』的翻译方法」，对于翻译学习会更有助益。其次是要关注整篇 GWR 的框架结构。每年的 GWR 洋洋洒洒上万字，如果缺乏结构观，读来便像被牵着鼻子走，还不知道所去何处。再有一点，是要关照 GWR 与其他文本表述的差异。不同的文本出自不同人之手，有些表述虽然 GWR 并未采用，但却是实际使用中更规范、更常用的说法，更需要格外注意。 第二，仅着眼共时，对历时把握不足。作为一份年年出新的文本，GWR 中很多表述不仅出现在当年 GWR，在往年文本中常常也有踪迹可寻。译法的变动总有其原因，发掘变动最好的方式，则是往前回看几年前的 GWR，从中领会译法变动的理据。此外，从历时的角度看待 GWR，还能够捕捉 GWR 乃至其他官方文本译文风格的变迁，从中一窥译文整体水平的起落。 有感于目前 GWR 「精读」类文章的一些不足，我打算把自己阅读、学习 GWR 的一些方法论写成文字，供大家参考、批评指正。这预计会是一个大长篇，最后具体有几篇，目前我也说不准，但整体框架如下： 第一部分（也就是本篇）为总论。我会介绍一下 GWR 这个文本的一些特点、阅读前要做的准备工作，以及阅读本系列需要做的前置准备。 第二部分，我会从结构视角大概介绍一下 GWR。宏观上，这部分会涉及 GWR 包括哪些部分、各部分之间有什么样的对照关系，等等；微观上，这部分会考察译文如何利用结构手段，解决原文固有结构对译文可能造成的一些问题。 第三部分，我会谈谈 GWR 中特定词汇的处理方式，其中既包括共时，也包括历时。 第四部分，我会谈谈 GWR 初稿译文中我认为有问题的地方，供大家商讨，也算是向大家请教。 第五部分也是最后一部分，要等到终稿译文发布，届时我会把这两版对比一下，看看都有哪些改动。 在正式开始之前，还有两点需要强调，也算是免责声明： 本文仅探讨 GWR 及其译文的语言问题，供语言学习者、翻译学习爱好者探讨参考，不构成任何政策解读、建议。 本文仅为向各位读者提供一个独特的 GWR 阅读视角，故假设读者已有一定的 GWR 阅读经验，对于 GWR 中涉及的特定词汇具体译法，不做穷举介绍。如有此类需求，请参阅其他资源。 文本介绍GWR 在每年全国人大的第一天发布一版，也就是总理在现场宣读的这一版。这版的左上角（英文是第一页）一般都会有这么一句话： 此报告以本次大会最后审议通过并由新华社公布的文本为准。 The official Chinese version of this report will be released by Xinhua News Agency. 这段话说明，会上宣读的版本，并非定稿，而是提交全国人大审议的版本。全国人大闭幕后，新华社会受权发布最终的定稿，其中会对文本进行微调。对于翻译学习来说，这意味着不光原文，译文也会一并进行调整，第一版中出现的问题，很多在终稿都会得以纠正或改善。根据不同层次，大家可以选择不同的学习方法和节奏： 如果只是初阶学习，建议只关注终稿。等到大会闭幕后一段时间，就可以去新华社获取终稿中英文了；也可以去 译之有道 蹲守，一般也是在闭幕后发布。前者是中英文分开的两个文件，而译之有道则可以提供按中文逐段对照，比较方便对照学习。 如果有较高需求，建议从初稿看起。直接看初稿，一来可以第一时间接触到 GWR 的译文相当于抢了先手；二来可以关注初稿译文中未必妥当的地方，既可以说是通过审读译文提升翻译水平，也可以说是为一笔的审校题作准备。 这一系列文章自然是从初稿开始看起。终稿发布后，我应该会再写一篇两版之间的出入对比，看看初稿中我能发现的一些问题在终稿会不会得到处理。（说是问题，其实也只是我自己不自量力的判断罢了。） 文本准备阅读、学习 GWR 的过程中，我的习惯是用 Word 随看随标注（文字处理软件不唯一，想用 WPS / LibreOffice 也可以），写下自己的一些想法。但首日第一时间传出的文本，格式以 PDF 为主，排版虽然美观，但使用起来就颇为不便。为此，需要把 PDF 上的文字转换为可编辑的形态，再放入 Word 文档。 要实现这个目的，我今年摸索出来的办法，是用无格式的纯文本文件作中介。用任何 PDF 转 .docx 的工具，最后得出的文件总会有各种各样的格式问题。而用纯文本文件，一来可以排除转换导致的格式不一致，二来可以较容易发现换行等带格式文本不易察觉的问题。至于格式，待导入文字处理工具后再调整也不迟。 由于首日流出的文本是中英文分立，对齐工作就得自己来做。我采用的是以中文为主，逐段对齐的路子。毕竟中文是 GWR 的原文，以中文为主，既可以保证中文意思连贯，不会因迁就英文而过度切分，又可以看出英译文在应对流水句等情况时，采取了哪些结构性策略予以解决。GWR 的对齐工作，我一般选择手动进行，也就是打开两个转换后的 PDF 文档（或者不转换也可以，但 PDF 可能会有很多的多余换行 / 分段符，之后处理更麻烦），外加一个空白的纯文本文档，中文复制粘贴一段、英文找到对应的段落复制粘贴。如果是较短的文本，可以考虑使用一些更自动化的办法，例如使用 Word 中的「文本转表格」「表格转文本」，但 GWR 译文在分段上更为激进，且长度实在令人咋舌，这样反而可能事倍功半，故不推荐。 到此，文本准备工作就算告一段落了。之后标注、批注，大家可以按照自己的喜好、习惯，各自进行。第一部分也算是结束了，之后，我会尽快把第二部分赶制出来，敬请期待。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。","link":"/2021/03/07/2021-03-07-gwr-1/"},{"title":"读书笔记：Translation and Conflict: A Narrative Account","text":"本文同时发于微信公众号。 这篇读书笔记，是我在学校读书时，应某门课的作业要求而写的。读完 Tiago Forte 的这篇文章 后，感觉这套读书方法很合自己的口味，便决定实践之，一来检验自己学习的成果，二来为这个内容贫瘠的平台添点料，三来巩固一下自己的读书所学，兼为拓展拙文中因偷懒而没有展开叙述的内容，补好 loose ends。 关于 Tiago Forte 这篇文章的文章，我也在少数派上写过，同样搬到 博客 上来。 为保证阅读体验，方便索引，本文添加了章节标题。文中除错别字外，不会进行改动。新添加内容，会单独启段，专门叙述。文末参考文献按照课程要求，使用 MLA 格式，而非翻译专业一般要求的 APA 格式，本文亦不予更换。 上次1 Theo Hermans 教授来北外做讲座，我有幸聆听。Hermans 教授在阐释译者能动作用时，引用了 Mona Baker 的 Translation and Conflict 中的相关理论，解释翻译过程如何将一种公共叙述中的文本、表述，移植到另一种公共叙述之中，以实现特定目的。这一理论引起了我的注意，于是，我便决定阅读 Baker 的 Translation and Conflict。读后发现，该书很大程度上是讲座中内容的进一步理论概括，对于理解现实翻译活动中译者的主观作用有很大帮助。有鉴于此，我便深入阅读 Translation and Conflict 一书，并撰写本读书报告。 由于本书标题中出现了两个含义极为宽泛的词，Baker 在导言中便分别对「冲突」（conflict）和「叙事」（narrative）两个词先下了定义。冲突无所不在，包罗万象，一切双方因目标、利益、价值观不同而相互贬损的行为，都可以称为「冲突」。但本书明显更侧重于「冲突」在人们脑海中最常见的印象，即政治冲突和武装冲突（political, armed conflict），并主要以这些情形为例子，阐释理论。谈及翻译与冲突的相关性时，Baker 指出，二者至少有四点联系。首先，宣战需要沟通，也就需要翻译；其次，战争中需要言语交流、政治宣传，因而需要翻译；第三，需要向全世界阐明己方的正义性、合法性，面向不同语言的受众；第四，调停战争的会议需要译员才能进行。此外，冲突之前，翻译也为冲突气氛的蓄积、传播贡献了相当的力量。 本书副标题为「A Narrative Account」，点出了本书观察翻译现象的切入点——叙事（narrative）。Baker 将本书所涉「叙事」，限定为社会学、传播学语境下的「叙事」概念，而非语言学中的「叙事学」（narratology）。这样的叙事，具有一定的社会功能，也是Baker此书选择此作为切入点的重要理由。首先，叙事在其传播过程中，可以将某一观点规范化（normalization），从而为社会大众所接受，成为不容置喙、为社会所公认的观点。其次，叙事不是铁板一块，能够因时而变，所以能在不知不觉中彻底改变人们对于事物的看法。由此，Baker 将视角从叙事转向翻译，认为翻译本身也是一种叙事，从而具有叙事的规范作用和社会影响力。 第二章本书正文大致分为两部分，前半部分（第 2-5 章）介绍与叙述相关的理论，后半部分（第 6-7 章）则着重探讨各种叙述中翻译所起的作用。第二章中，Baker对本书所使用的叙事分析框架进行了描述。本书中，叙事指「我们赞同并用以指导行为的公共和个人的『故事』」（public and personal ‘stories’ that we subscribe to and that guide our behaviour）。Baker 提出，叙事可以分为文学叙事和科学叙事两种。科学叙事尽管形式上更为客观（如最为客观的叙事为统计数字），但同样会传达出对某一事件所持的立场和观点。如19世纪的一些科学研究，套用科学术语，试图以出生、生长所在的地区，证明白人社会地位高、黑人社会地位低，便是套用科学理论，为种族歧视声辩，并使之合理化、规范化。单一叙事未必反映真实情况，而叙事本身又具备建构「真实」的能力。本书侧重于叙事的政治意义，而其中反映最明显的是支配与抵抗之间的斗争关系。强势文化的叙事占支配地位，但弱势文化可以利用强势文化的叙事，来挑战强势文化本身；而强势文化为维持支配地位，也会利用弱势文化的叙事手段，来巩固自身的支配。 第三章第三章中，Baker 考察了叙事的四种类型，即本体叙事（ontological narratives）、公共叙事（public narratives）、概念/学科叙事（conceptual/disciplinary translation）和元叙事/主导叙事（meta-narratives/master narratives）。 本体叙事依赖于其存在的集体叙事，因为集体叙事提供了本体叙事所需要的词汇、符号、语言结构等。因为本体叙述极强的个体特征，其翻译也会对译员造成极大挑战。例如，英国杜伦大学「Access to Justice」法律口译项目中，口译员在翻译虐童案件时会受到极大的精神压力；Hermans教授的讲座中，也提到南非种族隔离政策取消后，口译员会经历「第一人称移情」（first-person displacement）的情况，受到叙事者的感染。 公共叙事指范围大于个体的机构传播的故事，可能会与本体叙事相抵牾，也可能会因本体叙事而变化（如南非政府在种族隔离政策取消前后对曼德拉的刻画，从恐怖分子到民族解放英雄），还可能会因时代等因素的改变而改变（如美国对印第安人的态度，从过去的主张同化，到如今的主张保留少数文化）。翻译过程中，译员可能会接受并巩固公共叙事，也可能会接纳反对观点，反其道而行之。 概念叙事指社会学科乃至所有学科分析问题时，所用的词汇说法。这一节，Baker 主要关注概念叙事对其他类型叙事造成的影响，主要批评了亨廷顿在《文明的冲突》（The Clash of Civilization and the Remaking of World Order）一书中提出的「文明冲突」论，及其在翻译学研究中滥用的情形。同样，译者在翻译时，也可以选择接受并传播现有概念叙事，或者质疑之。 元叙事中，「每个人都是当代历史的参与者」，元叙事本身反映了时代最宏观的主题，如工业革命、资本主义与共产主义的斗争关系、个体与社会间的矛盾、自然/野蛮与文明间的冲突等，本身横跨相当长的时间，覆盖范围广。 第四章第四章中，Baker 引用了 Somers &amp; Gibson（1994）的叙事分析理论，提出叙事具有四个特征，即时间性（temporarity）、关联性（relationality）、因果情节组织（causal emplotment）和选择性利用（selective appropriation）。 时间性体现出叙事的连续性，而叙事内元素的安排决定了叙事的意义。由于不同文化对于时间的概念不同，有些场合也可能格外强调时间因素，但叙事，特别是本体叙事，往往由于回忆的因素，对事件发生的具体时间记忆不清，因此，译者可以在翻译时为其中一方强调时间的必要性，以实现更好的叙事效果。 关联性指出，人类无法理解孤立的事件，也无法理解杂乱拼凑起来的诸事件。事件、叙事的理解，有赖于适当的组织构成。而特定叙事中特定成分的使用，则会唤起人们不同的感受。例如，在一部讲述巴以冲突的纪录片中，描述巴勒斯坦人遭遇袭击的场面时，英文字幕对阿拉伯语原文有一些改动： 原文直译：We are still pulling out martyrs from underneath the ground. 英文字幕：We are still pulling victims out of the rubble. 原文直译：We have mentally retarded people who have been martyred; we have disabled people who have been martyred; we have children who have been martyred; we have women who have been martyred. 英文字幕：They killed some mentally disabled people, children and women in the camp. 可以看出，英文字幕将阿拉伯语中的「殉道」（martyr）一词改为「受害者」（victims）或「被杀」（killed），避免了「殉道」一词在宗教极端主义兴起的环境中，引起不必要的误会，避免引起对原教旨主义、恐怖袭击等的联想。 因果情节组织是在关联性基础上的更进一步，赋予组成叙事的各个部分以不同的意义和重要性，帮助受众理解。翻译过程中，也可以通过调整关键成分，改变因果情节组织。例如，美国一名法庭翻译在处理一起与巴勒斯坦人有关的案件中，就因为一系列模棱两可的词语而苦恼：「鹰嘴豆」（hummus）发音类似「哈马斯」（Hamas）；jihad 一词首字母大写为「圣战」，不大写则泛指斗争，等等。任意成分的解释，都会造成叙事结果的极大不同。 选择性利用指构建叙事时，会有选择地选用某些材料，排除另一些材料。这种选择既取决于叙事所希望达成的目的，也取决于构建叙事的人受到何种公共叙事影响。例如，一些学生在练习一段关于二战伤亡人数的材料，听到纳粹屠杀了 2500 万俄国人时，有两名学生甚至怀疑自己是否听错了，因而没有翻译。（按：可结合 Facebook 针对彩色苏军插红旗照片的处理讨论——虽然有些离题。） 第五章在第五章，Baker 借用了 Bruner（1991）的理论，补充了前述的四条叙事特征，引入了特殊性（particularity）、普通性（genericness）、规范性（normativeness）与累积性（narrative accrual）。 特殊性指叙事一般针对特定的人和事，而体裁性则表明，所有的叙事都符合「体裁故事大纲」（generic story outline），有一定的范式。但叙事范式有时会因文化不同而发生变化，翻译时可能会改变故事的发展方式和大纲，甚至于颠覆叙事的体裁，包括改变原叙事体裁，以符合目的语叙事规范；以及保留原叙事体裁，无视目的语体裁规范中的差异。 规范性包括符合规范和背离规范两部分，同时体现在叙事中，但背离规范的同时，又必须符合一定的规范，才能起到相应的反制作用。例如，一部关于巴勒斯坦人流离失所的纪录片中，英文字幕对一句话做了修改： 原文直译：What can I say, by God, by God, our home is no longer a home.英文字幕：What can I say? Not even Vietnam was as bad as this. 这个例子就同时体现了符合规范和背离规范：纪录片播放时（2000年），美国观众对巴勒斯坦人流离失所的情况并不了解，译者便运用越南战争的叙事，帮助实现沟通目的；而这种叙事的构建，本身又背离以色列所倡导的主流叙事。 累积性指一系列相关叙事反复出现，最终塑造文化、传统或历史。累积的对象可以是前述的任何一种叙事类型。 作为社会翻译理论的主要倡导者之一，Baker 在书中着重介绍了译者、出版商、编辑等角色在翻译过程中所发挥的主观作用。Baker 将这种作用描述为「构建」（framing），尤其特指对叙事的构建。构建本身具有模糊性。例如，「9·11」事件后，美国将一系列反对自身的暴力行为概称为「恐怖主义」，引来其他国家效仿，相当于架空了这一词语的本来含义。 但认可构建的主观作用，并不意味着构建不受任何制约。构建必须处在特定的语境之中。对于翻译而言，一方面应当遵守这种语境，另一方面又可以使用特定方式，绕过语境限制。Hermans 教授的讲座中，就提到利用副文本来表达译者自己的观点、构建新叙述，此处不再赘述。专就叙事构建而言，译者可以采用时空构建的方法，将文本置于不同时空，以凸显叙事效果，并引导读者将叙事与现实联系起来。构建叙述时，文本也可能被选择性利用，如公共叙事压迫与之不符的本体叙事，不允许某些作品出版、翻译；但译者也可以选择性利用某些材料，以反制公共叙事，如鲁迅和周作人编译的《域外小说集》，多选俄国、东欧作家的作品。Venuti（1998）认为，这些国家地位与中国相似，但其文学在国际上有一定地位，选用其作品可以改变中国在当时地缘政治中的从属地位。 构建过程中也会用到标签（labelling），指示叙事中的关键元素，从而影响叙事的效果，引导受众对叙事的反应。不同叙事对同一事物可能用不同的标签，从而构成叙事之间的对立。例如，韩日争议岛屿，韩方称「独岛」，日方称「竹岛」，中国媒体播报时，往往会说： 前不久，韩国总统李明博突然高调登上了韩日间存在主权争议的「独岛（日本称竹岛）」视察，引发了日本方面召回大使的强烈抗议。在短短的几天里，日本与中国和韩国的领土争端相继激化。这让我们不得不把视线投向日本海上那两座荒凉的小岛，在历史的长河中，它是如何成为韩日两国的纠纷焦点的？两国是如何围绕着它明争暗斗，韩国又是如何将其控制在手上的？它的得失，又能给关注钓鱼岛的我们带来什么样的经验和教训呢？（凤凰网，2012） 这样做可能是为了维持在韩日争端之间的中立地位。但正如上例中标注，中方对中日争议岛屿「钓鱼岛」的名称，则不会附上日方「尖阁诸岛」的称谓。事实上，综合考虑钓鱼岛争议，中国媒体优先选择韩方称呼「独岛」，附上日方称呼「竹岛」，可能也传达出中国方面对日方就钓鱼岛采取的一系列行为而做出的抗议。 第七章第七章中，Baker 提出以「叙事范式」（narrative paradigm）来评估叙事。叙事范式理论认为，人们对世界的理解并非完全依靠推理，而是通过以理性或感性的方式解读叙事来进行。理解的基础则是「充分理由」（good reasons），即人们接受叙事的理由。在此观点下，叙事的具体评估标准是连贯性和忠实性。连贯性主要包括叙事内部结构是否合理、采用素材是否全面、涉及人物是否性格一致三点。忠实性则包括理由逻辑和充分理由逻辑两部分，并利用两种逻辑分别评估叙事的理推理和价值观。这一范式的优点在于，其主要考虑价值观在叙事选择中的作用，比起传统的理性推理模式，更适合分析当今冲突之中的口笔译行为。 随着人们的交流变得深入而广泛，翻译活动作为交流的载体，在形式和目的上也与以往大不相同。传统语言比较的范畴有时很难解释一些翻译现象，反映出语言本身已经不再是翻译时的唯一考量。从社会功能的角度考察翻译现象，能够凸显翻译活动中译者等参与主体的主观能动作用，更好地体现翻译活动的本质和目的，不仅有助于翻译学科本身的发展，也能助力相关诸学科的进步。Baker 教授的 Translation and Conflict 一书着眼政治领域的冲突现象，便想必能够为国际政治等领域的研究提供崭新的理论视角，从而体现翻译学这一跨学科领域的独到作用。 参考文献Baker, Mona. Translation and Conflict: A Narrative Account. London; New York: Routledge, 2006. Bruner, Jerome. “The Narrative Construction of Reality.” Critical Inquiry, vol. 18, no. 1, 1991, pp. 1-21. Somers, Margaret R., and Gloria D. Gibson. “Reclaiming the Epistemological ‘Other’: Narrative and the Social Construction of Reality.” Social Theory and the Politics of Identity, edited by Craig Calhoun, Oxford; Cambridge, MA: Blackwell, 1994, pp. 37-99. Venuti, Lawrence. The Scandals of Translation: Towards an Ethics of Difference. London; New York: Routledge, 1998. 韩日「独岛（竹岛）」领土争端始末. 凤凰网, http://news.ifeng.com/history/shijieshi/special/dudao/. 2018 年 7 月 3 日访问. 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。 1.其事久远，按笔记上的时间来看，应为 2018 年 6 月，具体日期由于笔记文件曾被编辑，已不可考。 ↩","link":"/2021/01/07/2021-01-07-translation-conflict/"},{"title":"关于「屏幕使用时间」出现 24 小时使用量的 bug","text":"2021年以来，M1 Mac 的硬盘读写量超标 成了大家广泛关注的焦点。我的 MacBook Air 也不幸中招，购买两个月读写量就双双突破 10T，照此速率，四年后就要超过我的上一台 MacBook Pro 四分之一有余了。在排查原因过程中，我发现从上周开始，在「屏幕使用时间」里，有两个网站每天都能使用 24 小时： 这问题可够恶心的，毕竟据大家回报，kernal_task 是这次高读写量的罪魁祸首（之一），但其内容不透明，导致任何高强度长时间处于使用状态的进程，都值得成为我的怀疑对象。但上网一查，发现这个问题 早已有之，至少去年 11 月 Big Sur 实装之后就已出现。这样一来，网站常驻「屏幕使用时间」似乎就和磁盘读写量没啥关系了——毕竟我买来两个月，直到前几天才出现这个问题，而磁盘读写量的问题却是早已有之。 但话虽如此，这个问题却不能坐视不管，毕竟有两个进程在疯狂刷时间，我的屏幕使用时间统计（虽然我也不看）被扭曲了。基于此，这个问题我非解决不可。 问题分析这个问题从上周六（2021-03-06）开始出现，psv4.userapi.com 和 82.145.63.160 这两个网站，突然吃满了屏幕时间，哪怕是笔记本盒盖休眠也照用不误。观察电池统计数据，发现这一天虽然我用了 12h 的笔记本，但怎么也没有达到 24h 这么一个令人瞠目结舌的数字。 这样一来，只有两种可能：或者是这两个进程在后台偷偷占住了，导致「屏幕使用时间」把它们统计了进去；或者是系统出了 bug，导致某些网页会被莫名统计进去。 问题排查 1：后台占用先假设是确实发生了后台占用。打开「活动监视器」，发现这两个网站虽然每时每刻都在运行，但进程中全然不见它们的踪影。看来杀进程是派不上用场了。而除此之外，限制 App / 网站使用最好的办法，就是在「屏幕使用时间」中为 App / 网站添加限额，到时会弹出提醒。于是乎，我给这两个网站分别设置了 1 分钟的限额，以观后效。 计划很完美，我甚至看到弹出了限额通知（可惜没有截图）。但第二天（2021-3-9），「屏幕使用时间」里，这两个崽种还是时时刻刻在运作： 这也从事实上证明，第一条路子走不通。 问题排查 2：系统 bug第一条路是个死胡同，我就去网上查其他人有没有碰到类似情况。无独有偶，Reddit、Apple Community 上都有用户反馈类似情况。虽然在其他人的反馈中，出现问题的网页是 YouTube、Twitter 之类的，平台也包括了 iPhone，但性质总归是相通的。Apple Community 上，大家普遍认为这是个 bug，Reddit 上一些人也有同样观点，但 Reddit 老哥更进一步，认为可能是这些进程在后台挖矿。这个想法虽然说天马行空，但也不是全无可能。 说到这里，似乎有必要谈谈这俩是什么链接。psv4.userapi.com 倒好解释，是老毛子网站 vk.com 下载东西用的域名。我周五也似乎确实用这个网站下载了些东西，但下载之后就把相关网站关掉了，且之前也没有出现过长时间占用的问题。 第二个 IP 地址就更为搞笑了，是给 macOS 替换图标的 macosicons 的 IP。我是不觉得这个网站有什么「拿用户电脑悄悄挖矿」的必要，毕竟「Buy me a coffee」光明正大地挂在那儿。 所谓「遇事不决就重启」，我也打算把这个当成最后的筹码。重启之后，我第一时间截屏留证了这两个网站的屏幕时间使用情况： 奇迹出现了：这两个网站的屏幕使用时间，还真就定格在了 1 小时 4 分钟。 总结绕了这么大一圈，最后居然是用最无脑、最受诟病的解决方案根除了问题。只能说重启虽然听上去很像是懒人一招鲜，但有的时候真的能吃遍天。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。","link":"/2021/03/09/2021-03-09-screen-time-24h-bug/"},{"title":"shiftscreen：「完整」的 iPadOS 外接屏幕体验","text":"本文同时发于少数派。 iPad 外接屏幕这件事，自从 2018 年搭载 USB-C 接口的 iPad Pro 问世以来就引起了广泛关注，大家在试用这一功能时，最大的抱怨恐怕莫过于屏幕两端巨大且无用的 pillarbox 了。虽然 iPad 硬件上做好了准备，但由于 iPad 外接显示器只能镜像屏幕、不能扩展，且缺乏离屏互动方式，也就是没有鼠标、键盘这套解放双眼的交互手段，这个功能始终没有引发波澜，基本只能把 iPad 变成「超大号爱奇艺」。 iPadOS 13.3 更新中，iPad 支持了鼠标，苹果也顺势推出了 Smart Keyboard，又在软硬件上往前迈了一步。但「扩展屏幕」这关键一步却迟迟没有迈出，iPadOS 14 的更新中依然欠奉，总之是造成了一定的不满。但苹果做不到的，总有人会去另辟蹊径。一如随航推出之前，Duet Display 完成了「把 iPad 作为 Mac 外接屏幕」的任务，如今一款叫 shiftscreen 的 app 便可以补上这个缺憾。我手头上正好有 iPad Pro（2018）和 LG 27UL850，于是就下载了下来，把玩了一番。 如何使用打开 shiftscreen，你可能会很诧异：这怎么就是一个浏览器？诚然，shiftscreen 的工作模式，和浏览起真的没什么两样：顶部一个集成了搜索栏的地址栏，加上一堆意义不明的按钮，构成了这款 app 的全部。但当你接上显示器，shiftscreen 就会进入准备状态，外接显示器也会变成紫色的一片。此时，正中会出现两个按钮，可以从一系列预设的网站中选择，也可以在地址栏中搜索、查找想要打开的网站。 选择好要打开的网站后，外接显示器上就可以全屏显示出当前网页了，比起之前两边粗大的黑边，观感自然好了不少。但是，shiftscreen 主打的并不只是完整的外接显示器使用体验，更重要的是实现了外接显示器上的分屏体验。在 iPad 上点击右下角的紫色按钮，会弹出「窗口管理」选单，点击「创建新的窗口」，再选择「创建新的标签」，就可以实现外接显示器上边到边的完整分屏体验了。用这个方法，最多可以实现同屏四「窗口」，大小也可以在 iPad 上进行调整。而 shiftscreen 又支持两个「虚拟桌面」，这也就意味着，你可以使用下方的窗口切换按钮，一键在外接显示器上的八个「窗口」中自如切换。 既然用上了外接显示屏，此时最自然的交互方式就是用上键盘和鼠标 / 触控板了。接上之后，整个使用体验与电脑外接显示器不能说没有区别，但也几乎所剩无几。本文的引子部分，就是用 shiftscreen 在外接显示器上写成的。虽说 iPad 本身也可以在 Safari 中用少数派编辑器写稿，但毕竟显示器的显示范围没有得到充分利用，而 shiftscreen 则补上了这个缺憾。 shiftscreen 同时还支持 iPhone。如果你有条件将 iPhone 接到显示器上，那么 iPhone 变身「桌面操作系统」也不是个梦了。此时，你可以把 iPhone 用作触控板，控制光标移动。但我手头上没这个条件，因而未能尝试。除了有线接入，shiftscreen 还支持 AirPlay。如果家中正好有 Apple TV，无需一堆头咬尾的转接线，便能体会到大屏带来的新奇体验。 在显示器上使用时，你可能会注意到，此时的鼠标光标不是 iPadOS 规定的小圆点，而是一个与 macOS 别无二致的箭头。虽然这个箭头无法根据上下文变换形态，但确实带来了一种「桌面操作系统」的错觉。当然，如果你偏爱 iPadOS 的小圆点，可以在 shiftscreen 的设置菜单中更改。设置菜单中，你还可以调整网页的默认缩放比例、外接显示器显示帧率等。 除了 Office、Google Docs、iWork、Slack 这些干活用的软件，shiftscreen 还能实现外接显示器观看视频。只需打开视频网站，点击界面下方右侧的切换控制按钮，就可以把视频网站变成专门的控制页面，内容则依然在显示器上播放，防止切换标签页而导致视频挂到后台停止播放。 shiftscreen 甚至还支持多任务。在 iPad 上，先打开 shiftscreen，再将其他 app 拖入窗口制造分屏，将 shiftscreen 放在左侧三分之一，便可以在不耽误外接显示屏的情况下，继续使用 iPad 做其他更适合触控的事情了。结合前面提到的视频播放，你就可以把想要观看的网课用 shiftscreen 放在大屏幕上，再用本地分屏打开笔记软件，边看边记，还能用 shiftscreen 的视频控制界面随时方便暂停、步进。 最后，除了打开网页，shiftscreen 还可以调用 iPadOS 的文件选择界面，打开本地文件，和网页一起并排放。 原理、缺点和展望看完了 shiftscreen 的诸多特性，你可能不禁会问： 这 app 是怎么绕过苹果做到外接显示器全屏显示加分屏的？ 其实说来也简单。分屏的部分实现不算太难；最有意思的地方其实是「在外接显示器上全屏」。如果你用过 iPad 加外接显示器，就会知道有一种情形，可以让 iPad 充分利用外接显示器的显示范围，那就是播放视频。而这也是 shiftscreen 实现全屏显示的奥秘所在。如果你之前又恰好用过 Duet Display，就可能知道，Duet Display 之所以能在随航面世之前实现「把 iPad 作为 Mac / PC 的显示器」，就是用「诱骗创建软件桌面——把操作压缩成视频——在 iPad 端 app 播放视频」这个思路。这也正是为什么 Duet Display 和 shiftscreen 都需要在前台运行才能使用（因为这样才能一直放视频），都提供了画质帧率选项（为的就是让用户在视频传输的质量和效率间做取舍，从而达到利用外接显示屏的目的）。 但既然是第三方的解决方案，瑕疵自然是在所难免的，以下简述几条。 使用体验，例如光标不能根据上下文变化、本地缩放比例发生变化后光标跟踪速度也会随之变化、打开文件不支持中文编码会变乱码。这些都体现出这款 app 仍处在一个较早期的阶段。 软件非原生解决方案，实际运行就是在放视频，因而效能不甚理想。其实这个问题在 Duet 上也有体现。虽然可以通过线连，但分辨率、帧率和响应速度都会受到影响，Mac / PC 本身也会因为额外运算而备受压力。 最大的问题在于，shiftscreen 本质上就是一款支持标签页分屏的浏览器，只支持 web app 意味着如果你的工作流中每包括一款 web app 覆盖不到的 app，那 shiftscreen 便会鸡肋一分；分屏浏览器则意味着同时支持的最大 web app 打开数有限，如果需求超过了 8 个窗口，那也超出了 shiftscreen 的能力范围。 话虽如此，web app 包括 PWA 依然是在不断发展的。Apple、Google、Microsoft 的主要在线办公服务都有网页端，Slack、Trello、Evernote、Airtable 等协作软件更不必提，就连编辑本文所用的少数派编辑器，也是以网页形式存在的1。网页能做到的事情，理论上来讲只会更多，不会更少。当此时机，shiftscreen 横空出世，也算是顺应了潮流、把握了潮流，让可用性在 iPadOS 的沙盒之中有了质的飞跃。虽然 shiftscreen 比起 shift，更像是一个 makeshift，但起码展现出了客观条件不允许的情况下，开发者用一切手段，将这一大家呼声极高的功能努力实现的探索精神。如果你有给 iPhone / iPad 外接显示器的手段，如果你的工作流纯用 web app 可以搞定，如果你也想尝鲜，那 shiftscreen 也不失为一个选择。否则，还是等苹果画完这张一定会有个说法的饼吧。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。 1.没有催更独立 app 编辑器的意思。 ↩","link":"/2021/03/17/2021-03-17-shiftscreen/"},{"title":"译文｜字号无用，是否有解？","text":"本文翻译自 Font size is useless; let’s fix it，已获作者授权。 如果你在自用的文本编辑器里设置 &quot;font_size&quot;: 32，会是什么效果？如果你也思考过这个问题，那为最好；如果没有，且听我慢慢道来。 要想知道答案，不如上手试试。我自用的编辑器是 macOS 上的 Sublime Text 4: 实际测量文字大小会发现，「32」这个数字踪迹全无： 可以看出，32 既非字高（char height），也非字宽（char width），不是大写字高(cap height）或 x 字高（x-height），更不表示上下端线（ascending / descending line）1的位置。这是为什么？ 从「点」开始首先，font-size 规定的并非像素数，而是点（point / pt）数。点脱胎自现实世界中的字体排印，是一个物理尺度，1 点等于 1/72 英寸（约 0.353 毫米）。之所以使用点作为字号单位，是为了用现实世界中的物理单位度量文字大小，而无需考虑屏幕分辨率等无关紧要的细节。所以，如果我想让文字高度为 2 英寸，我只需将字号设置为 144 pt。 但实际操作却是另一番光景。例如，macOS 从来都是用 72 PPI 的像素密度把点数换算为像素数。如果在 32 寸 和 24 寸显示器上同时显示 1080p 分辨率下 100 pt 的内容，macOS 会让两者的像素大小相等，实际大小却并不相等，可谓南辕北辙。 为什么是 72 呢？这是因为，Mac 最早搭载的显示器，像素密度就是 72 PPI。这样一来，文字在屏幕上的显示大小就等于印刷出来的实际大小，不可谓不方便。当然，Mac 显示屏的像素密度自那之后不断攀升，但这个换算关系得以保留2。 作为「相爱相杀」的好伙伴，Windows 使用的则是 96 PPI，而非 72 PPI。至于背后原因，当然不是因为 Windows PC 屏幕更好（其实并不好3），而是因为 72 个像素不足以渲染出清晰可辨的文字。那既然如此，干脆把文字放大 1/3 得了呗。 事实上，Windows 也确实是这么做的。这就导致即使现在，Windows 上的 16 pt 依然比 macOS 上的 16 pt 大 1/3。笑了。 P.S. VS Code 似乎将 editor.fontSize 的值直接视为像素数。这算是开了个好头！ Em 空格由上可知，如果用户将字号设置为 32 pt，macOS 和 Windows 会分别显示 32 px 和 43 px 大小的文字。但即使如此，文字大小也并不是 32 px 或者 43 px。这是因为 font-size 规定的是所谓的「em」，也即传统活字印刷中每个活字的高度。至于为什么叫 em，那是因为「m」这个字母的活字正好是正方形，因此，「m」的宽度 == 活字的高度 == 1 em4，就这么简单！ 而在数字字体中，em 外框（em square）则指： […] a grid of arbitrary resolution that is used as the design space of a digital font. —— Wikipedia: em(typography) ……固定分辨率的方格，用于数码字体的设计。—— 维基百科：em（字体排印学） ……任意分辨率的方格，规定了设计数码字体所用的空间。——自译 也就是说，如果我打开 Fira Code，画一个 em 外框，它跟任何东西都对不上。 简而言之，这个外框才是你设置字号的时候，实际改变的东西。如果你将字号设置为 32 pt，那这个外框就会变成 32 px 或 43 px 高 / 宽。可惜这个外框一来并不可见，二来与字体的任何元素都不对应。 问题所在当我说「em 的大小是任意指定的，与字体的任何元素都不对应」时，我可不是在夸张，而是事实本来如此！这就意味着，同一字号的不同字体，观感上大小会截然不同。比方说，当我把这两款不同字体的 em 外框调整至相同大小（也即字号相同），m 的高度可是大相径庭： 再举一例，图中这些字体的文字都是 22 pt： 总结一下，字号这个尺度有以下问题： 难以预测：设置的结果完全无法预料。16 pt 到底等于多少像素？ 不实用：想要的结果永远得不到。想要 13 px 高的文字吗？有梦是好事。 不连续：换个字体，不改字号，文字可能变大，也可能变小。 因操作系统而变：同一份文档，换个操作系统打开，显示的效果也会不一样。此外，编辑器的配置文件也不能跨系统共享。 解决之道为今之计，解决方法有二： 指定大写字高，而非 em 外框的大小；并且 以像素作为指定大小的单位。 一般来说，大写字母是界定文字块边界的参考系。因此，把控制文字大小的尺度定为大写字高，而非其他什么任意指定的参数，就合理多了。 下面这几款字体的字号都一样： 而下图是同样的字体，字号却各不相同，以确保大写字高一致： 起码我个人觉得，后者看起来更统一。（试比较 Cascadia 和 Consolas；Hack 和 IBM Plex Mono；Ubuntu Mono 和 Victor Mono。） 再谈行高既然都说到这儿了，再把行高的问题也解决了如何？不必担心，我会很快搞定。 首先，各家编辑器在行高这个问题上可以说是百花齐放、各行其是： 为什么会这样？行高的问题在于，其计算标准同样是字符的抽象边界： 这个传统承袭自活字印刷时代。毕竟，一行的高度不可能低于字面本身： 但数字字体设计还照此操作，可就行不通了。和字号的情况相同，字符上下留空的大小可说是千人千面，十分随意。有的上下留空非常富裕，有的则只够放下上升部和下降部。 而即便是后者这样留空刚刚好的字体，也并不理想。上升部和下降部都是字体向外延伸的部分，并不影响我们对文字边界的观感。诚然，技术上讲，适宜的行高应当妥善容纳上升部和下降部，确保二者不重叠相交。但从美观的角度来说，这么紧密的行距值得商榷。 总而言之，虽然设计师在设计字体时有充足的空间放置字符的边界，但保持行高一致也就成了空中楼阁。 预测行高解决这个问题最合理的办法，就是将行高直接设定为固定的像素数，忽略一切与字体相关的参数。或者，行高也可以设为大写字高乘以一个百分比。但无论如何，都不要与 font-size 或「自动」行高扯上关系！ 还有很重要的一点，就是永远不要把行高设定为行与行之间的空白（即活字排印中的行间距 [leading]）。如若不然，不同的文字大小就会打乱段落的节奏： 相反，行高应设定为基线之间的距离： 此外，我也不认为所谓的「默认行高」是什么好东西。这个数值基本上就是按照字体设计师个人的喜好来，却要强加于所有用户的所有使用场景。默认行高可以是任意数值（而事实上也确实够「任意」的），但「大写字高的 200%」则顾名思义，就是大写字高的 200%。 总结一下，如今的现状是，换一款字体，行高就会变成不知道什么样子： 而我理想中的状况是，换一款字体，每一行的位置依然固定不变： 换个角度一想，我们身处计算机时代，却在字体上还保留了如此多排印时代的陈规旧矩，也是够绝的。 总结陈词我如上种种主张，都是为了满足一个非常简单的使用场景： 可以一次性配置编辑器的字号和行高； 可以尝试不同的字体； 而不需要每次换字体都重新配置字号和行高。 就像这样（大写字高和行高完全一致）： 而我理想中的 UI 则是： 其实还有一个使用场景，就是以确定、可靠的方式，将按钮中的文本居中。这在网页显示上是老大难了，但最近连 macOS 都犯了同样的毛病： 网页上用什么字体往往超出控制，又恰恰没有信得过的工具来对齐文本，这怎么想都是一项重大疏失。 参考链接 Getting to the bottom of line height in Figma。Figma 尝试在预期效果和网页的实际工作原理之间找到一个折中方案。 Deep dive CSS: font metrics, line-height and vertical-align。这篇文章详细介绍了字体和 CSS 行高算法的工作原理。 Capsize 这个 JS 库现在就能在 web 端的重重限制之下，实现我在文中描述的效果。 Leading-Trim: The Future of Digital Typesetting。这篇文章介绍了 leading-trim（相当于大写字高）如何解决上述问题。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。 1.原文使用 ascender / descender，指西文向上或向下突出的部分，中文一般称「上升部 / 下降部」。——译者注 ↩2.Mac 采用高分屏后，屏幕显示以逻辑分辨率为准。此时，72 PPI 中的「72」为逻辑像素数，而非屏上的实际像素数。关于 px、pt、ppi，可参阅 从第一代 iPhone 细数到 iPhone 12，iPhone 屏幕尺寸进化历程背后的 app 设计哲学；该文对于「点」的解释应批判看待。——译者按 ↩3.作者个人观点。——译者注 ↩4.作者此处的观点应批判看待。参见 「中西之别」重考：「……西文字母都不是以「正方形」，而是以「变宽」（或者说是「成比例」）为原则的设计的。」；全角半角碎碎念：「单纯说「字宽」，到底是字母 W 的宽度还是 I 的宽度，会造成很大歧义。因此在西文里才会有这样一个需求，必须定一个参考标准，于是才出现了 em 和 en 这两个概念：在排字方向上（西文一般为横排）与字号同样的那个量称作一个 em，而其一半即为 en。之所以这么称呼，坊间传说是源自大写字母 M 和 N 的宽度，但是做过字体设计的人都知道，在实际的字体里由于字面与字身存在的距离（即所谓「边距」，side bearing），在大多数情况下一套字的大写字母 M 和 em 的宽度应该是不一样的。」下文 Wikipedia 页面也指出，1 em 就等于活字的通高，与字母 M / m 的大小无关。——译者按 ↩","link":"/2021/05/18/2021-05-16-font-size-zh-trans/"},{"title":"每日一句｜may","text":"本文同时发于微信公众号。 本文基于 SF 符号 beta 版本 3.0 (55)。 SF Symbols（SF 符号）是苹果整的一个设计资源参考库，里面包含了 app 里能用的符号。有的符号右下角会有一个 i，表明有进一步信息，点开之后，上面是这么一句话： 此符号可能无法修改且可能仅可用于指代 Apple 的 XXXXX。 这句话是我去年无意间发现的。当时读来读去，怎么读怎么别扭。什么叫「可能无法修改」？意思是其实还能修改？什么叫「可能仅可用于」？意思是不用于苹果规定的用途也行？如果是这样，那这句话放在这里又有什么意义呢？配上这句话的，都是苹果自家的产品或功能，按逻辑和苹果的调性，这些符号肯定不能拿来干别的，和「可能」这个词完全冲突。 除了意思上讲不通，这句话的行文也非常别扭。「可能仅可用于」一句，两个「可」重复而多余，且也前后矛盾：前一个「可」表明有选择的余地，紧跟着的「仅」就直接杜绝了这种余地。 要想知道这句话到底啥意思，还得去看英文原文是什么。改了语言一看： This symbol may not be modified and may only be used to refer to Apple’s XXXXX. 那这就很明显了：所有的「可能」对应的都是 may 这个词，而 may 偏偏有一个翻译新手常翻的错误，也就是「望文生义」。查《元照》： 法律上常用助动词，通常表示可以作为，可以任选其一，而非强制性的必须作为；但有时也可作「须」〔must〕或「应」〔shall〕解，一般涉及公职人员责任时，可有此含义，但必须根据上下文全面理解。 另见《法律英语：中英双语法律文书制作》；这也是我研究生期间的一本应读书： 第二，当否定语和情态动词一起使用的时候，存在着和否定语有关的施为性作用问题。举个例子来说，禁止性的语言「may not」所指示的是取消许可。以一个评论者的眼光来看，如果你考虑到法律自身的施为性作用，「不得（may not）)」要比否定式的命令「不得（shall not）」更为合适。 两相结合，也就是读书时老师一定会讲到的「不是『可以不』，而是『不可以』」。结合之前的分析，苹果之所以写这么一句话，为的就是明示用户，这些符号不许改、不许挪作他用。由此，可以对原译文稍作改动： T1：此符号可能无法修改且可能仅可用于指代 Apple 的 XXXXX。 T2：此符号不得修改，且仅可用于指代 Apple 的 XXXXX。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。","link":"/2021/06/19/2021-06-19-may-not/"},{"title":"WWDC 2021 「简短」感想","text":"今年的 WWDC 守住了 WWDC 最后的颜面：没有发布任何新硬件。软件层面撑住了 1 小时 50 分钟，感觉会是近年来最「褒贬不一」的一场发布会。以下简述；由于基于手写笔记，所以可能有缺漏之处，一切以最终正式版系统软件为准。 共通更新原本想分平台说的，没想到今年绝大多数功能都是三端同步发布，有些甚至是四、五端同步。所以与其按平台说，不如先把一致的功能说了。 FaceTimeFaceTime 今年表现出了不小的野心。视频通话功能而言，FaceTime 与主流视频会议软件全面看齐，新功能包括会议日程通知、语音分离（降噪）、网格模式、网页端，但最让人激动的还是 SharePlay，可以共享音、视频，甚至终于实现了大家一直在等的 iOS / iPadOS 屏幕共享。虽说「船大难调头」，但苹果终于还是在疫情第二年为远程办公的「新常态」做出了早就该做出的努力。最令人意想不到的是网页端 FaceTime。照这么看，其他端的 iMessage 也不是不行，只是苹果想不想做的问题。 iMessage说到 iMessage，今年的动作不如去年大，但是充分与苹果生态内的其他服务打通。看来苹果是要在打造自己社交平台的同时，进一步增加订阅服务的价值，用社交为自家产品赋能（这话好「大厂风」啊）。 FocusFocus 这套工作模式切换的方案，在工作场景逐渐电子化的 WFH 时代似乎还算值得期待。要想最大程度发挥这套系统的优点，依然有赖于同一 app 登陆多端。希望苹果能努把力。 Intelligence这应该是让我下巴张得第二大的环节。苹果终于做了自家的图片 OCR 方案，深度集成在任何可能出现图片的地方，发布即支持简繁中文。摄像头支持识别物体，认花认鸟的 app 需要思考怎么打出差异化的牌。Spotlight 显示的信息更丰富全面，手机、iPad 上一直用着暂且不表，电脑上或许可以再用回去一段时间，让 Alfred 先歇歇。Photo Memories 能看出苹果想进军短视频的野心，但今年的步骤还算温和，没有推出自家平台，反倒是与抖音 / Tik Tok 的合作不少。 此外，钱包支持门卡、房卡（兼容性待观察）；天气 app 换上了卡片化新设计，信息更全面；地图信息更详细（在大陆 / 内地的支持程度依然取决于高德），公共交通可以置顶线路、到站提醒，还能扫描周遭环境指路（在大陆 / 内地亮相的可能性极低）。 Notes备忘录又向前迈出了一大步。协作功能进一步增强，加上深度系统融合、优秀的手写支持，第三方共享文档服务最基本的功能其实已经替代得七七八八了。从 iPad 屏幕右下角用 Apple Pencil 可以拉出小窗，摘取当前 app 的内容，做快速笔记确实不错。如果能有标签系统的话，就再好不过了。 勘误：此次更新后，备忘录已支持标签功能。 AirPods今年 AirPods 的软件更新主要是给带降噪的 Pro 和 Max 预备的。Conversation Boost 可以自动分离人声；降噪强度终于可以调节了（虽然突破上限不指望了）；读出信息扩展至读出通知；AirPods Pro 接入「查找网络」；tvOS 上支持空间音频；以及 Dolby Atmos 正式亮相。这些其实都是本就应有、锦上添花的功能。 SafariSafari 真的是一年一个样，希望这次不要再变了。其实看完今天的发布会，我眼中最惨的应该是 Firefox：89 刚刚界面大美化，就被第一方浏览器赶上了不少。此次 Safari 也原生支持了标签组，Tab Space（我在用的标签组插件）恐怕不太好受，共享标签组也非常轻松写意，导出格式也算美观整洁。至于搜索栏集成在标签页上、工具栏仅留一个「新建标签页」，恐怕是个见仁见智的改进。扩展终于可以跨平台使用了，这着实是大新闻，用来拦截内容农场的 uBlacklist（我在用的）终于可以在 iPhone 上一展身手了（但愿如此）。 不同之处📱 iOS 15没想到今年第一个居然是 iOS，家庭「弟」位这就确立起来了。今年 iOS 度假的更新其实就两个值得关注，一个是拖拽功能回归，一个是 Safari。 拖拽在 iOS 11 来到 iPhone 与 iPad 上，但这个功能本质上还是专为 iPad 的大瓶多点触控操作设计的。iPhone 在最早的几个 beta 过后，能触发拖拽的地方被砍得七七八八，如今在照片 app 里都很难找到用途。这次 iOS 15 把拖拽加回来，其实也是为了保证多端体验统一。 Safari 迎来的改变恐怕比其他几个平台都要大。Safari for iOS 抛弃了 iOS 7 以来的设计，采用了其他第三方浏览器之前尝试过的「底端地址栏」方案，单手操作的体验有了提升。此外，Safari for iOS 还加入了一大堆手势操作，具体的我没有细看，还是需要上手才能明白怎么玩。这项更新看起来虽好，但学习成本无形之中被拉高了不少。估计会褒贬不一。 📋 iPadOS 别怪我，谁让苹果不给平板电脑的 emoji 的。 iPadOS 15 绝对是「最令人失望奖」得主了。除了早就该来的小组件随意摆放，剩下的更新刚才都说过了——除了 Swift Playgrounds。但这一项也够重磅的，因为这个名字里带「play」的 app，现在支持了完整的 Swift 开发体验，编写、上架一气呵成，是编程教学 app 里的豪杰。如今的 Swift Playgrounds，已经和不支持第三方库的 Xcode 没啥差别了，只是苹果梗着脖子就是不开发而已。白瞎了 M1 和那么大的内存。 好的一点在于，多任务操作更加得心应手了。分屏按钮、改进的 Exposé、App Library，都补足了之前 iPadOS 多任务的一些槽点，打造出了 iPad 专属的多任务体验。 ⌚️ watchOS 和 📺 tvOS这俩其实没啥好说的，因为该说的功能，之前基本都覆盖到了。Apple Watch 支持太极可能是国内用户最关注的点。Mindfulness（正念？）app 也更好看了。睡眠支持呼吸监测，对于我这样的呼吸暂停患者其实是件好事。 💻 macOS之前说 Intelligence 是我下巴张得第二大的环节，那张得第一大的，非 macOS Monterey 莫属了。「连续互通」升级为 Universal Control，对 HarmonyOS 形成了两面包夹芝士；这一点其实我是非常乐见的，虽然我一直对 HarmonyOS 冷嘲热讽，但那基本都是处于我对华为这家公司的意见和不满，如今 HarmonyOS 在多端协同的发布时间上起码领先了苹果，说明这条路没走错。 说回 Universal Control，用户可以用一套键鼠横跨 macOS 和 iPadOS，控制多台设备，随意交换文件。发布会没展示 iOS 设备的情况，暂时不做乐观估计。有人可能会对 Universal Control 的稳定性表示担忧，但考虑到 Sidecar 的稳定性，个人认为这个功能翻车的可能性不大。目前有两个待解之谜： Universal Control 如何确定不同设备之间的位置关系？ Universal Control 是否需要专门打开，还是自动开启？ 这两个疑问，只能等刷了系统才能慢慢分析了。 顺便一说，快捷指令也登陆 macOS 了，但 Automator 一时半会儿还不会退出历史舞台。期待快捷指令在 macOS 上大放异彩。 👨‍💻 开发者Object Capture 带来了更便捷的建模流程。App Store 可以展示 A / B 营销（大概是这么个意思）和 In-App Events（应用内活动）。Xcode Cloud 是苹果自家的云端 CI，收费情况只字未提。TestFlight 登陆 macOS。 总结今年的 WWDC，两大趋势值得注意。第一是苹果终于开始加力远程办公、共享办公领域，虽说没起个大早，但也不算赶了晚集。凭借深度系统集成，苹果应该还是能啃下一块肉来。但正如苹果自己筑起了护城河，其他 app 早在过去一年里，就悄无声息地构建起了自己的用户群。苹果已经交出了自己的答案，能否破局尚不好说，苹果自己是否真的想要破局更是只有天知道。 第二个趋势，是主要新功能尽量保证三端统一。这篇文章最大的篇幅，贡献给了各系统共享的功能，与往年各个系统分别写的传统有了很大区别。从苹果统一硬件的努力来看，软件上功能不断趋同、体验日臻统一只是时间问题。如果说以往苹果还只是暗示，那今年把 iOS 顶在最前开发布会，无疑是把路人皆知的司马昭之心，请司马昭亲口说了出来而已。这个方向有好有坏。好的地方在于，全家桶用户乃至更广泛的苹果设备用户，可以进一步在自家生态内密切协作，进一步利用苹果自家的服务套餐。坏的地方在于，iPad 的独特地位可能还要再晚至少一年才能到来。为了迁就其他两个平台，特别是 iOS，iPadOS 并没有改变「大号 iOS 设备」的本质，软件上迈出的步子尚不足以吃透 M1 的实力，这也构成了今年 WWDC 最大的遗憾点。 一切的遗憾，都只能留待明年慢慢解决了。按理来说，明年是软件更新的大年，希望苹果能不负众望，给他们眼中计算设备的新形态——iPad，再加一把力。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。","link":"/2021/06/08/2021-06-08-WWDC-2021/"},{"title":"读书｜读书札记方法论","text":"本文同时发于少数派。 本文是对 Tiago Forte 的这篇文章 的整理。这篇文章无论是对自己的日常思考，还是真的着手写读书札记，都很实用，原本打算总结下来自用，看到王老师 @玉树芝兰 的文章中提到了，发现似乎少有人介绍，于是便整理下来，放到少数派（首发地）上，也算是实践了文章中的方法，有助于深入领会。 「读书破万卷，下笔如有神。」但现实往往是，书读得不少，笔记记得挺多，可读便只是读了、记便只是记了，混乱不堪，缺乏整理，到用时根本无从下手。破局之路有二，一是压减读书的规模，从原先多读、泛读，到少读、精读；二是将笔记与书剥离，单独放置，形成「读书札记」，便于检索。既然要写读书札记，就意味着将书本转化成为己所用的素材，因而，要运用创造力和主观能动性，要本着「一千个读者眼中有一千个哈姆雷特」的精神，从有意义、有效用、能执行的角度对原书进行阐释/解读（interpreting）。最终形成的读书札记，自然要切中肯綮，避免在繁复的论证过程上浪费笔墨。 写读书札记的好处每篇读书札记，大约需耗时 10–20 小时（作者语，依个人情况而定），若能持之以恒，定能大有收获，要之有六，于己有关的细说，于己无关的少说。 帮助吃透书本内容。人们常说「带着目的阅读」，写读书札记也不失为一种目的。有了明确的目的，在标记重点时，也会有所取舍，从而培养筛选有价值信息、作出价值判断的能力。 为思考、创作提供素材。知识的输入服务于输出，输出依赖输入。但创作时，某个观点的出处，往往在脑海中只剩下一丝微弱的印象，若要从头找起着实耗费心力。但若能将读过的书中最核心、价值最高的要点总结出来，便如同有了一份核心要点的「索引」。长此以往，便能搭建出一个「知识网」，从任意节点均可切入，也能省去每次都介绍一番背景状况的麻烦。Roam Research（付费） / Obsidian（可免费） / Foam 等工具就是这样的思路。 通过仿写提升写作能力。仿写时模仿的不仅是字、词、句，还有原作者的思维模式。仿写也不是单纯的照抄，而是用自己的话解释（paraphrase），一方面可以提升自己的表达、写作能力，同时也能检验自己对知识掌握的程度，就像老师常说：「学到的知识，能用自己的话，把别人给讲明白了，那就是真的学会了。」 扩大读者群。 建立人脉。 提升互联网讨论中的话语权。 这三条和笔者没什么关系，就不细表了。简而言之，写得越多，就能吸引更多读者；说不定就能和原书作者牵线搭桥；在网上说话的时候也会更有分量，成为引述的源头、secondary source 的出处。 如何选材选书如按图索骥，只是这「图」未必是 XX 畅销书单，毕竟畅销书早已被人翻遍嚼烂，造轮子意义不大；真正的「图」，应当包括落在自己兴趣边界上1的那些书。最终选出的书，应该满足有趣味（以便吸引读者）、够独特（方能增添新知）、有助益（才能解决问题）这三个标准，且以札记总结后，能为未来取用节省时间者，当为最佳。 写读书札记的过程，也是将书中知识、观点介绍给别人，在读者和书本之间牵线搭桥的过程。读者可能并不熟悉书中所涉知识领域，所以，札记的创作者还要担负起「大使」「翻译」2的职责，用读书札记拓宽读者视野，展现单凭自己无法涉足的未知领域。同时，既然要读的书都「落在自己兴趣边界上」，对自己的视野有所拓展，创作读书札记这一过程，也可以帮我们摆脱信息茧房，接收更多元的观点。 读书札记写作步骤作者将写作读书札记的全流程分为五步，下面分别叙述。 第一步：阅读、标重点读一本书大概需要 5–10 小时（作者语，依个人情况和具体书籍而定），就写作读书札记的目的而言，是时间成本最高的部分。为了一次通关，标注重点不可或缺。标重点这件事，其实争论挺大。一方面，它属于开头讲的「笔记记得挺多」的一种表现形式，如果简单划过去，那就毫无意义，甚至可能降低阅读效率；另一方面，边读边划本身就体现了读者的能动性，划重点能反映读者对书中内容详略与否的把握，锻炼读者获取关键信息的能力。读书时也就是动动笔、动动手指的功夫，不会扰乱阅读流。 作者推荐用 Kindle 阅读电子书。（按：这篇文章以阅读电子书为前提。纸质书在原理上互通，但时间等因素可能会有差异。）Kindle 虽然写批注体验极差，但划重点还是可以的，导出的体验也不错，配合 Klib、Knotes 等第三方解决方案更是如虎添翼。如果不是特别在意墨水屏的观感，用智能手机上的 Kindle app，体验可以上升一大截。除此之外，Apple 全家桶用户也可以用「图书」（原 iBooks），但一来格式上仅支持 epub 和 PDF，二来这 app 年久失修，划重点时会非常飘，导出也不太方便。 标重点需要参照前文提到的三个标准。这三条虽然说起来简单，但做起来实属不易。读起书来，总会有「我全都要」这种鳌拜上身的感觉，整段整段地划，得不偿失。为克服这一问题，作者给出了几条经验之谈： 要标的： 章节标题，方便把握脉络； 列表、摘要，直接拿来利用； 热门标注（Kindle 专享），他人劳动成果。但热门标注中，有的标注让人完全摸不到头脑，有的可能还不符合下文「已经了解的观点」这一条，需要仔细筛选，不能照单全收。 不要标的： 整段整段的文字，不然根本分不出重点； 整篇整篇的事例，不过是论述用的手段； 已经了解的观点，不然不符合三条标准。 第二步：导出重点阅读器/阅读 app 的问题就在于，笔记不导出，等于没有记。前文提到过 Klib、Knotes，作者还给出了 Readwise（付费）和 Bookcision（免费）两款服务，用来导出 Kindle 上的笔记。这两款笔者没用过，就不妄加评价了。笔记导出后，可以放到 Evernote/印象笔记 Microsoft OneNote Bear Notion 前文提到的 Roam Research / Obsidian / Foam 等服务中，以备下一步使用。 第三步：渐进式归纳（Progressively summarize）虽然手头有已经导出的笔记可用，但这些笔记毕竟是抽离了具体语境的只言片语或框架结构，若要令其有用武之地，就有必要增添内容，但这又需要在简洁和易懂之间取得平衡。为实现这一目的，本文作者提出了「渐进式归纳」（视频、文章）的概念，下面简述之。 渐进式归纳将归纳过程分为五步： 输入原始文本，也就是前述「导出重点」这一步。 加粗重要部分，主要是传达核心思想的关键词句。这一步需要处理大量的文本，且加粗操作在移动端需要的步骤可能过于繁琐（以 iOS / iPadOS 为例，选中 -&gt; BIU -&gt; 粗体，全都需要悬腕操作），建议在 PC 上进行。加粗处理也是一个回顾全书内容的过程，即便在此过程中，发现这本书不值得写成札记也没有关系，可以留存备考。 高亮加粗部分中的重要部分，精益求精。这一步操作在作者看来，算是一种被动行为，最好在移动设备上进行，当作消遣，比如夜深人静，忙完一天的工作，往沙发 / 床上一靠，拿起 iPad 标标点点。建议在前一步使用的服务中进行，省得来回来去倒腾东西。由于过这一遍时仅关注最核心的点，所以很轻松就可以将篇章上相距甚远，但意旨无比接近的内容关联起来，有助于进一步提炼、精简书本内容。 在对应条目的上方，用自己的语言重述加粗、高亮的观点。 对某些值得外延 / 可以外延的内容，借助 Roam Research / Obsidian / Foam 等工具，整合关联观点，进行重组。 总的来说，这五步是先按照「关键段—关键句—关键词」的步骤，先进行知识的输入，最后加上结合其他知识的输出。这其实就是上学时老师讲「先把书读薄，再把书读厚」的过程，先提取要点，再在要点的基础上扩充内容、建立联系。这五步务必放慢节奏，多利用碎片时间，甚至每步之间间隔上一段时间，才不至于被同样的信息反复轰炸，以致失去重点。 第四步：整理大纲整理大纲，就是要将前面提取出来的信息点重新排布，将别人的文本彻底转化成自己的文本。这一步仍然是一个去芜存菁的过程，要把最值得写的点精选出来，且最好一气呵成，一次性对比所有提取出来的要点，这样才好在点与点之间建立联系。列出的大纲遵循树状结构，以本文为例，大概就会是这样： 写读书札记的好处 好处一 好处二 …… 读书札记写作步骤 第一步：阅读、标重点 第二步：导出重点 …… 读书札记的意义 意义一 意义二 …… 第五步：写作完成了前面那些，终于到了正式写作的过程了。有了前面那些的积累，就不必再为概念性、结构性的东西纠结，剩下的就是按照自己的节奏，挥洒自己的创造力了。 写作时仍然要注意遵循写作的一般原则，即易懂、简明。除此之外，还要注意略去冗长的例子，代之以简明的例子，如果是自己发掘、亲身体会的事例，则为更佳；慎用大段的直接引用，否则「札记」便成了「书评」3。 读书札记的意义除去前面写到的六点好处，读书札记在作者看来还有一大意义，就是用有深度的思考，克服「信息爆炸」（”Infodemic”）的冲击。我们每天接收到的信息确实比以往更多，但多是未经咀嚼、囫囵吞枣。东西再好，也终究是「别人家的东西」，还是二手的，难以为我所用。读完一些东西，写上一篇这样的札记，便是一个梳理的过程，是对 content curation 的 content curation，是对各种「N 大方法」的进一步提炼和向外延伸：提炼是在繁杂中捕捉精髓，延伸是跳出原文的框架束缚，主动迎接新观点的产生、观点之间的碰撞。 文后复盘和感想这篇文章第一次实践，很多时间都浪费在找外围资源上；大多数引用都是纯靠记忆和巧合，以及一点模糊的印象，导致许多附加的评论空洞无物。由于所处行业并非码字为生、产出内容，所以对于其中的一些点（例如以整理各种「N 大方法」为主业）缺乏共鸣。总的来说步履维艰，且因为工作原因，战线越抻越长，到了最后几乎失去了开始创作时的那种热情，所谓「万事开头难」是也。所幸毅力傍身，还是把这篇文字勉强拼凑齐了。 完成这篇习作时，遇到的第一个劝退点，是在知乎上纯粹偶然遇到了这么个问题：阅读一本书可不可以只看别人整理出来的思维导图？下面回答的主流观点是「没有必要」，笔者一开始的想法亦然，又想到读书札记何尝不是一种思维导图，就顿生退缩之意。但又细细一想，思维导图与本文所指的读书札记还是有区别。思维导图不过是抽干了论述过程的论点集合，用具有逻辑的方式呈现出来，本质上是装饰更精美的目录，说句难听的，不过是空架子一具。这样的东西，读与不读真的没有区别4。读书札记（或至少本文所构想的「读书札记」）则需要创作者积极思考、主动出击，撷取书中虽有价值的内容，以不那么干瘪，甚至是非常生动、直观的语言呈现出来，并加上与其他文外内容的联系。其耗费的心力、具有的价值，自然同单纯的思维导图不可同日而语——当然，前提是真的能维持统一标准，持之以恒。 第二个劝退点，在于思考如何在自己的操作流中，实现作者描述的那几个步骤。笔者基本不用 Kindle，虽然远离了糟糕的批注体验，但同时也与便捷的导出体验作揖告别。看完作者关于联系、标注等的论述，笔者脑海中蹦出来的首选工具，是 MarginNote 3：有纯阅读视图，在页边做标记；有脑图视图，方便整合逻辑、构建联系；有大纲视图，可以保证树状结构，且大纲视图和脑图视图联动，还省去了单独生成一次生成树状结构的麻烦。此外，笔者读的书，大多只有 PDF 版，Kindle 的 PDF 阅读体验路人皆知，而 MarginNote 对 PDF 的支持相当可以，扫描版也能用 OCR 搞定。 但相较网络式笔记工具，MarginNote 3 缺乏跨学习项目（「笔记本」）的关联方式，若想在不同文档、记录之间构建联系，就非得将不同的文本放在一个项目中，长此以往，必定会导致项目臃肿不堪，管理起来也非常费劲。惟今之计，非得用上 Roam Research 之类的解决方案不可。 第三个劝退点，在于自己读的书，未必适合作者给出的这套流程。之前读 After the Babel 的时候就犯了「在事例上兜圈子」的错误（见前文 OneNote 截图）。但它的事例写得太好了。其实这也是一对矛盾：如果作者想要表明的观点就隐藏于事例中，不探讨事例，就无法阐明作者观点，该怎么办？本文作者举了些自己写过札记的「书」，都是些较「功利」5的，如： The Complete Guide to Landing a Book Deal How To Take Smart Notes: 10 Principles to Revolutionize Your Note-Taking and Writing The Body Keeps the Score: Brain, Mind, and Body in the Treatment of Trauma Pleasure as an Organizing Principle How Emotions Are Made: The Theory of Constructed Emotion Emergent Strategy: Organizing for Social Justice You Need a Budget: 13 Parallels Between Money and Productivity A Pattern Recognition Theory of Mind Trekonomics: The Economics of Post-Scarcity Supersizing the Mind: The Science of Cognitive Extension The World Beyond Your Head: How Distraction Shapes Who We Are The Inner Game of Work: Focus, Desire, and Working Free Strategically Constrained: How to Turn Limitations Into Opportunities A Theory of Unlearning: Ecstasis, Anamnesis, Kenosis 充斥着「How to」「Guide」「Principle」「Emotion」「Smart」「Mind」「Inner」之类的鸡汤标签6，其实也已经非常「畅销书单」7了，这又何尝不是一种对自己的背叛呢？读这样的书，确实可以按照作者的流程，写出一篇吸引人来看、还能变现的文字，书评也好，札记也罢。或许非「功利」的书，天生就不适合这样的流程，也未可知。不过回头想来，5–10 个小时看完 After Babel 这样的书，想想就不可能。 但话说回来，这世上本就没有完全量身定制的东西。要想为己所用，或者削足适履，强行改变自己的习惯，套用别人的东西；或者批判继承，取彼之长补己之短，在关键节点上就着自己的习惯稍做改造，说不定也能打开一片全新的天空。与笔者个人而言，也算是为这类网状结构笔记工具设想过一些使用情景，结合这篇文章，似乎也是时候试一把了。 Tiago Forte 的系列文章和视频的确是不可多得的宝藏，特别是其中关于工作流的思考和实践。由于篇幅和精力所限，本文也只覆盖了「渐进式归纳」等方法论的冰山一角，有兴趣的读者，可以移步他的 博客 和 YouTube 频道 进一步了解。 欢迎将您的想法、评论、意见、建议发送至 harveyjanson@icloud.com，请注明「讨论」字样，我会尽量回复。 1.注：此处原文为「Instead of bestsellers, I look for books that are on the fringes of the topics I care about.」本文直译。推测作者本意，应该是指既与读者关心的话题有所牵连，又能在此基础上有所拓展的书，否则尽读些熟悉领域的书，始终无甚长进。 ↩2.作者用了「大使」「翻译」这两个比喻，但笔者觉得结合上下文，中文语境下更合适的喻体应该是「科普作家」——特别是难度方面。就此而言，写读书札记若非为了变现，真的是「用爱发电」。 ↩3.按《现代汉语词典》，札记：读书时摘记的要点和心得；书评：评论或介绍书刊的文章。就本文所介绍的「summary」而言，笔者个人认为「札记」更佳。「札记」强调摘记要点、记录心得，这与写作 summary 的要求、步骤相合。 ↩4.个人理解。 ↩5.个人理解。 ↩6.个人理解。 ↩7.个人理解。 ↩","link":"/2021/01/07/2021-01-07-tiago-forte/"}],"tags":[{"name":"每日一句","slug":"每日一句","link":"/tags/%E6%AF%8F%E6%97%A5%E4%B8%80%E5%8F%A5/"},{"name":"GWR","slug":"GWR","link":"/tags/GWR/"},{"name":"COVID-19","slug":"COVID-19","link":"/tags/COVID-19/"},{"name":"GSTI","slug":"GSTI","link":"/tags/GSTI/"},{"name":"China Daily","slug":"China-Daily","link":"/tags/China-Daily/"},{"name":"语法","slug":"语法","link":"/tags/%E8%AF%AD%E6%B3%95/"},{"name":"Chinglish","slug":"Chinglish","link":"/tags/Chinglish/"},{"name":"Plain English","slug":"Plain-English","link":"/tags/Plain-English/"},{"name":"十八大报告","slug":"十八大报告","link":"/tags/%E5%8D%81%E5%85%AB%E5%A4%A7%E6%8A%A5%E5%91%8A/"},{"name":"十九大报告","slug":"十九大报告","link":"/tags/%E5%8D%81%E4%B9%9D%E5%A4%A7%E6%8A%A5%E5%91%8A/"},{"name":"Mona Baker","slug":"Mona-Baker","link":"/tags/Mona-Baker/"},{"name":"Tiago Forte","slug":"Tiago-Forte","link":"/tags/Tiago-Forte/"},{"name":"Screen Time","slug":"Screen-Time","link":"/tags/Screen-Time/"},{"name":"bug","slug":"bug","link":"/tags/bug/"},{"name":"iOS","slug":"iOS","link":"/tags/iOS/"},{"name":"iPadOS","slug":"iPadOS","link":"/tags/iPadOS/"},{"name":"显示器","slug":"显示器","link":"/tags/%E6%98%BE%E7%A4%BA%E5%99%A8/"},{"name":"iPad","slug":"iPad","link":"/tags/iPad/"},{"name":"iPhone","slug":"iPhone","link":"/tags/iPhone/"},{"name":"字体","slug":"字体","link":"/tags/%E5%AD%97%E4%BD%93/"},{"name":"设计","slug":"设计","link":"/tags/%E8%AE%BE%E8%AE%A1/"},{"name":"WWDC","slug":"WWDC","link":"/tags/WWDC/"},{"name":"watchOS","slug":"watchOS","link":"/tags/watchOS/"},{"name":"tvOS","slug":"tvOS","link":"/tags/tvOS/"},{"name":"macOS","slug":"macOS","link":"/tags/macOS/"},{"name":"Swift","slug":"Swift","link":"/tags/Swift/"},{"name":"progressive summary","slug":"progressive-summary","link":"/tags/progressive-summary/"}],"categories":[{"name":"翻译","slug":"翻译","link":"/categories/%E7%BF%BB%E8%AF%91/"},{"name":"About Me","slug":"About-Me","link":"/categories/About-Me/"},{"name":"读书","slug":"读书","link":"/categories/%E8%AF%BB%E4%B9%A6/"},{"name":"Apple","slug":"Apple","link":"/categories/Apple/"},{"name":"App","slug":"App","link":"/categories/App/"},{"name":"Apple","slug":"翻译/Apple","link":"/categories/%E7%BF%BB%E8%AF%91/Apple/"}]}